ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v6.0
processor: MCIMX6QPxxVT
package_id: MCIMX6QP7CVT8AA
mcu_data: i_mx_1_0
processor_version: 6.0.0
pin_labels:
- {pin_num: T4, pin_signal: GPIO_1, label: USB_OTG_ID, identifier: USB_OTG_ID}
- {pin_num: A23, pin_signal: SD2_DAT2, label: CHG_ENABLE, identifier: CHG_ENABLE}
- {pin_num: A22, pin_signal: SD2_DAT0, label: CHG_CAPGOOD, identifier: CHG_CAPGOOD}
- {pin_num: T1, pin_signal: GPIO_2, label: CHG_PFW, identifier: CHG_PFW}
- {pin_num: J19, pin_signal: EIM_D29, label: PMIC_INT_B, identifier: PMIC_INT_B}
- {pin_num: V25, pin_signal: DISP0_DAT18, label: EN_PMIC_I2C, identifier: EN_PMIC_I2C}
- {pin_num: A18, pin_signal: NANDF_D0, label: LED90, identifier: LED90}
- {pin_num: C17, pin_signal: NANDF_D1, label: LED91, identifier: LED91}
- {pin_num: F16, pin_signal: NANDF_D2, label: LED92, identifier: LED92}
- {pin_num: D17, pin_signal: NANDF_D3, label: LED93, identifier: LED93}
- {pin_num: N1, pin_signal: CSI0_DAT4, label: CAM1_TRIG, identifier: CAM1_TRIG}
- {pin_num: P2, pin_signal: CSI0_DAT5, label: CAM1_STRB, identifier: CAM1_STRB}
- {pin_num: N4, pin_signal: CSI0_DAT6, label: CAM1_RST_n, identifier: CAM1_RST_n}
- {pin_num: N3, pin_signal: CSI0_DAT7, label: CAM1_PWDN_n, identifier: CAM1_PWDN_n}
- {pin_num: R2, pin_signal: GPIO_16, label: CAM2_LFLT_n, identifier: CAM2_LFLT_n}
- {pin_num: R1, pin_signal: GPIO_17, label: CAM2_RST, identifier: CAM2_RST}
- {pin_num: T2, pin_signal: GPIO_9, label: CAM2_LOCK, identifier: CAM2_LOCK}
- {pin_num: P3, pin_signal: CSI0_DATA_EN, label: CAM2_ENPWR, identifier: CAM2_ENPWR}
- {pin_num: R7, pin_signal: GPIO_3, label: CPU_ENET_INTn, identifier: CPU_ENET_INTn}
- {pin_num: V22, pin_signal: ENET_REF_CLK, label: PHY_RSTn, identifier: PHY_RSTn}
- {pin_num: V5, pin_signal: KEY_ROW4, label: REMOTE_RST, identifier: REMOTE_RST}
- {pin_num: R6, pin_signal: GPIO_4, label: USB_PWREN, identifier: USB_PWREN}
- {pin_num: R4, pin_signal: GPIO_5, label: USB_RESETn, identifier: USB_RESETn}
- {pin_num: V6, pin_signal: KEY_ROW0, label: UART4_RX}
- {pin_num: W5, pin_signal: KEY_COL0, label: UART4_TX}
- {pin_num: T6, pin_signal: KEY_COL4, label: UX_PWR_EN, identifier: UX_PWR_EN}
- {pin_num: C25, pin_signal: EIM_D16, label: UX_5V_OC, identifier: UX_5V_OC}
- {pin_num: W6, pin_signal: KEY_COL2, label: UX_GSTIC_RSTn, identifier: UX_GSTIC_RSTn}
- {pin_num: W4, pin_signal: KEY_ROW2, label: UX_GSTIC_TS, identifier: UX_GSTIC_TS}
- {pin_num: M1, pin_signal: CSI0_DAT10, label: UART1_TX}
- {pin_num: M3, pin_signal: CSI0_DAT11, label: UART1_RX}
- {pin_num: G22, pin_signal: EIM_D25, label: RS485_DE, identifier: RS485_DE}
- {pin_num: E24, pin_signal: EIM_D26, label: RS485_D}
- {pin_num: E25, pin_signal: EIM_D27, label: RS485_R}
- {pin_num: G23, pin_signal: EIM_D28, label: RS485_REn, identifier: RS485_REn}
- {pin_num: T3, pin_signal: GPIO_6, label: SER_PWR_EN, identifier: SER_PWR_EN}
- {pin_num: G21, pin_signal: EIM_D19, label: WIF_PWREN, identifier: WIF_PWREN}
- {pin_num: G20, pin_signal: EIM_D20, label: WIF_RESETn, identifier: WIF_RESETn}
- {pin_num: B21, pin_signal: SD1_CMD, label: WIF_CMD}
- {pin_num: A21, pin_signal: SD1_DAT0, label: WIF_DAT0}
- {pin_num: C20, pin_signal: SD1_DAT1, label: WIF_DAT1}
- {pin_num: E19, pin_signal: SD1_DAT2, label: WIF_DAT2}
- {pin_num: F18, pin_signal: SD1_DAT3, label: WIF_DAT3}
- {pin_num: D25, pin_signal: EIM_D23, label: MOD_PWREN, identifier: MOD_PWREN}
- {pin_num: F22, pin_signal: EIM_D24, label: MOD_RESETn, identifier: MOD_RESETn}
- {pin_num: P6, pin_signal: GPIO_18, label: MOD_IGTn, identifier: MOD_IGTn}
- {pin_num: P5, pin_signal: GPIO_19, label: MOD_PWRIND, identifier: MOD_PWRIND}
- {pin_num: T25, pin_signal: DISP0_DAT9, label: LCD_3V3_EN, identifier: LCD_3V3_EN}
- {pin_num: P24, pin_signal: DISP0_DAT0, label: LCD_BLU_EN, identifier: LCD_BLU_EN}
- {pin_num: P22, pin_signal: DISP0_DAT1, label: LCD_REV_SCAN, identifier: LCD_REV_SCAN}
- {pin_num: P23, pin_signal: DISP0_DAT2, label: LCD_SEL_6OR8, identifier: LCD_SEL_6OR8}
- {pin_num: R22, pin_signal: DISP0_DAT8, label: LCD_PWM}
- {pin_num: H19, pin_signal: EIM_A25, label: HDMI_CEC}
- {pin_num: U5, pin_signal: KEY_COL3, label: I2C2_SCL}
- {pin_num: T7, pin_signal: KEY_ROW3, label: I2C2_SDA}
- {pin_num: T5, pin_signal: GPIO_0, label: AUD_MCLK}
- {pin_num: U22, pin_signal: DISP0_DAT20, label: AUD4_TXC}
- {pin_num: T20, pin_signal: DISP0_DAT21, label: AUD4_TXD}
- {pin_num: V24, pin_signal: DISP0_DAT22, label: AUD4_TXFS}
- {pin_num: W24, pin_signal: DISP0_DAT23, label: AUD4_RXD}
- {pin_num: F21, pin_signal: EIM_D17, label: I2C3_SCL}
- {pin_num: D24, pin_signal: EIM_D18, label: I2C3_SDA}
- {pin_num: P20, pin_signal: DISP0_DAT4, label: SPK_PWREN, identifier: SPK_PWREN}
- {pin_num: P21, pin_signal: DISP0_DAT3, label: USON_PWREN, identifier: USON_PWREN}
- {pin_num: B17, pin_signal: SD4_CMD, label: ULTS1_TXD3}
- {pin_num: E16, pin_signal: SD4_CLK, label: ULTS1_RXD3}
- {pin_num: U7, pin_signal: KEY_COL1, label: ULTS2_RXD5}
- {pin_num: U6, pin_signal: KEY_ROW1, label: ULTS2_TXD5}
- {pin_num: H20, pin_signal: EIM_D21, label: USB_OTG_OCn}
- {pin_num: E23, pin_signal: EIM_D22, label: USB_OTG_PWR}
- {pin_num: R3, pin_signal: GPIO_7, label: CAN_TX}
- {pin_num: R5, pin_signal: GPIO_8, label: CAN_RX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
}

