ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'false', coreID: ca9_0}
- pin_list:
  - {pin_num: C12, peripheral: SRC, signal: boot_mode0, pin_signal: BOOT_MODE0}
  - {pin_num: F12, peripheral: SRC, signal: boot_mode1, pin_signal: BOOT_MODE1}
  - {pin_num: A22, peripheral: GPIO1, signal: 'gpio, 15', pin_signal: SD2_DAT0, direction: INPUT}
  - {pin_num: A23, peripheral: GPIO1, signal: 'gpio, 13', pin_signal: SD2_DAT2, direction: OUTPUT}
  - {pin_num: T1, peripheral: GPIO1, signal: 'gpio, 2', pin_signal: GPIO_2, direction: INPUT}
  - {pin_num: F21, peripheral: I2C3, signal: scl, pin_signal: EIM_D17}
  - {pin_num: D24, peripheral: I2C3, signal: sda, pin_signal: EIM_D18}
  - {pin_num: J19, peripheral: GPIO3, signal: 'gpio, 29', pin_signal: EIM_D29, direction: INPUT}
  - {pin_num: V25, peripheral: GPIO5, signal: 'gpio, 12', pin_signal: DISP0_DAT18, direction: OUTPUT}
  - {pin_num: A18, peripheral: GPIO2, signal: 'gpio, 0', pin_signal: NANDF_D0, direction: OUTPUT}
  - {pin_num: C17, peripheral: GPIO2, signal: 'gpio, 1', pin_signal: NANDF_D1, direction: OUTPUT}
  - {pin_num: F16, peripheral: GPIO2, signal: 'gpio, 2', pin_signal: NANDF_D2, direction: OUTPUT}
  - {pin_num: D17, peripheral: GPIO2, signal: 'gpio, 3', pin_signal: NANDF_D3, direction: OUTPUT}
  - {pin_num: H20, peripheral: USB, signal: usbotg_oc, pin_signal: EIM_D21}
  - {pin_num: E23, peripheral: USB, signal: usbotg_pwr, pin_signal: EIM_D22}
  - {pin_num: T4, peripheral: GPIO1, signal: 'gpio, 1', pin_signal: GPIO_1, direction: INPUT}
  - {pin_num: N1, peripheral: GPIO5, signal: 'gpio, 22', pin_signal: CSI0_DAT4, direction: OUTPUT}
  - {pin_num: P2, peripheral: GPIO5, signal: 'gpio, 23', pin_signal: CSI0_DAT5, direction: OUTPUT}
  - {pin_num: N4, peripheral: GPIO5, signal: 'gpio, 24', pin_signal: CSI0_DAT6, direction: OUTPUT}
  - {pin_num: N3, peripheral: GPIO5, signal: 'gpio, 25', pin_signal: CSI0_DAT7, direction: OUTPUT}
  - {pin_num: R2, peripheral: GPIO7, signal: 'gpio, 11', pin_signal: GPIO_16, direction: INPUT}
  - {pin_num: R1, peripheral: GPIO7, signal: 'gpio, 12', pin_signal: GPIO_17, direction: OUTPUT}
  - {pin_num: T2, peripheral: GPIO1, signal: 'gpio, 9', pin_signal: GPIO_9, direction: INPUT}
  - {pin_num: P3, peripheral: GPIO5, signal: 'gpio, 20', pin_signal: CSI0_DATA_EN, direction: OUTPUT}
  - {pin_num: R7, peripheral: GPIO1, signal: 'gpio, 3', pin_signal: GPIO_3, direction: INPUT}
  - {pin_num: V22, peripheral: GPIO1, signal: 'gpio, 23', pin_signal: ENET_REF_CLK, direction: OUTPUT}
  - {pin_num: V5, peripheral: GPIO4, signal: 'gpio, 15', pin_signal: KEY_ROW4, direction: OUTPUT}
  - {pin_num: R6, peripheral: GPIO1, signal: 'gpio, 4', pin_signal: GPIO_4, direction: OUTPUT}
  - {pin_num: R4, peripheral: GPIO1, signal: 'gpio, 5', pin_signal: GPIO_5, direction: OUTPUT}
  - {pin_num: N6, peripheral: I2C1, signal: sda, pin_signal: CSI0_DAT8}
  - {pin_num: N5, peripheral: I2C1, signal: scl, pin_signal: CSI0_DAT9}
  - {pin_num: V6, peripheral: UART4, signal: rxd_mux, pin_signal: KEY_ROW0}
  - {pin_num: W5, peripheral: UART4, signal: txd_mux, pin_signal: KEY_COL0}
  - {pin_num: T6, peripheral: GPIO4, signal: 'gpio, 14', pin_signal: KEY_COL4, direction: OUTPUT}
  - {pin_num: C25, peripheral: GPIO3, signal: 'gpio, 16', pin_signal: EIM_D16, direction: INPUT}
  - {pin_num: W6, peripheral: GPIO4, signal: 'gpio, 10', pin_signal: KEY_COL2, direction: OUTPUT}
  - {pin_num: W4, peripheral: GPIO4, signal: 'gpio, 11', pin_signal: KEY_ROW2, direction: OUTPUT}
  - {pin_num: M1, peripheral: UART1, signal: txd_mux, pin_signal: CSI0_DAT10}
  - {pin_num: M3, peripheral: UART1, signal: rxd_mux, pin_signal: CSI0_DAT11}
  - {pin_num: G22, peripheral: GPIO3, signal: 'gpio, 25', pin_signal: EIM_D25, direction: OUTPUT}
  - {pin_num: E24, peripheral: UART2, signal: txd_mux, pin_signal: EIM_D26}
  - {pin_num: E25, peripheral: UART2, signal: rxd_mux, pin_signal: EIM_D27}
  - {pin_num: G23, peripheral: GPIO3, signal: 'gpio, 28', pin_signal: EIM_D28, direction: OUTPUT}
  - {pin_num: R3, peripheral: FLEXCAN1, signal: txcan, pin_signal: GPIO_7}
  - {pin_num: R5, peripheral: FLEXCAN1, signal: rxcan, pin_signal: GPIO_8}
  - {pin_num: T3, peripheral: GPIO1, signal: 'gpio, 6', pin_signal: GPIO_6, direction: OUTPUT}
  - {pin_num: G21, peripheral: GPIO3, signal: 'gpio, 19', pin_signal: EIM_D19, direction: OUTPUT}
  - {pin_num: G20, peripheral: GPIO3, signal: 'gpio, 20', pin_signal: EIM_D20, direction: OUTPUT}
  - {pin_num: B21, peripheral: uSDHC1, signal: cmd, pin_signal: SD1_CMD}
  - {pin_num: A21, peripheral: uSDHC1, signal: dat0, pin_signal: SD1_DAT0}
  - {pin_num: C20, peripheral: uSDHC1, signal: dat1, pin_signal: SD1_DAT1}
  - {pin_num: E19, peripheral: uSDHC1, signal: dat2, pin_signal: SD1_DAT2}
  - {pin_num: F18, peripheral: uSDHC1, signal: dat3, pin_signal: SD1_DAT3}
  - {pin_num: D25, peripheral: GPIO3, signal: 'gpio, 23', pin_signal: EIM_D23, direction: OUTPUT}
  - {pin_num: F22, peripheral: GPIO3, signal: 'gpio, 24', pin_signal: EIM_D24, direction: OUTPUT}
  - {pin_num: P6, peripheral: GPIO7, signal: 'gpio, 13', pin_signal: GPIO_18, direction: OUTPUT}
  - {pin_num: P5, peripheral: GPIO4, signal: 'gpio, 5', pin_signal: GPIO_19, direction: INPUT}
  - {pin_num: T25, peripheral: GPIO4, signal: 'gpio, 30', pin_signal: DISP0_DAT9, direction: OUTPUT}
  - {pin_num: P24, peripheral: GPIO4, signal: 'gpio, 21', pin_signal: DISP0_DAT0, direction: OUTPUT}
  - {pin_num: P22, peripheral: GPIO4, signal: 'gpio, 22', pin_signal: DISP0_DAT1, direction: OUTPUT}
  - {pin_num: P23, peripheral: GPIO4, signal: 'gpio, 23', pin_signal: DISP0_DAT2, direction: OUTPUT}
  - {pin_num: R22, peripheral: PWM1, signal: pwmo, pin_signal: DISP0_DAT8}
  - {pin_num: H19, peripheral: HDMI, signal: cec_line, pin_signal: EIM_A25}
  - {pin_num: U5, peripheral: I2C2, signal: scl, pin_signal: KEY_COL3}
  - {pin_num: T7, peripheral: I2C2, signal: sda, pin_signal: KEY_ROW3}
  - {pin_num: T5, peripheral: ASRC, signal: asrc_ext_clk, pin_signal: GPIO_0}
  - {pin_num: U22, peripheral: AUDMUX, signal: aud4_txc, pin_signal: DISP0_DAT20}
  - {pin_num: T20, peripheral: AUDMUX, signal: aud4_txd, pin_signal: DISP0_DAT21}
  - {pin_num: V24, peripheral: AUDMUX, signal: aud4_txfs, pin_signal: DISP0_DAT22}
  - {pin_num: W24, peripheral: AUDMUX, signal: aud4_rxd, pin_signal: DISP0_DAT23}
  - {pin_num: P20, peripheral: GPIO4, signal: 'gpio, 25', pin_signal: DISP0_DAT4, direction: OUTPUT}
  - {pin_num: P21, peripheral: GPIO4, signal: 'gpio, 24', pin_signal: DISP0_DAT3, direction: OUTPUT}
  - {pin_num: B17, peripheral: UART3, signal: txd_mux, pin_signal: SD4_CMD}
  - {pin_num: E16, peripheral: UART3, signal: rxd_mux, pin_signal: SD4_CLK}
  - {pin_num: U7, peripheral: UART5, signal: txd_mux, pin_signal: KEY_COL1}
  - {pin_num: U6, peripheral: UART5, signal: rxd_mux, pin_signal: KEY_ROW1}
  - {pin_num: A8, peripheral: PMU, signal: 'gnd, 1', pin_signal: GND1}
  - {pin_num: A13, peripheral: PMU, signal: 'gnd, 2', pin_signal: GND2}
  - {pin_num: A25, peripheral: PMU, signal: 'gnd, 3', pin_signal: GND3}
  - {pin_num: C1, peripheral: PMU, signal: 'gnd, 5', pin_signal: GND5}
  - {pin_num: B4, peripheral: PMU, signal: 'gnd, 4', pin_signal: GND4}
  - {pin_num: C4, peripheral: PMU, signal: 'gnd, 6', pin_signal: GND6}
  - {pin_num: C6, peripheral: PMU, signal: 'gnd, 7', pin_signal: GND7}
  - {pin_num: C10, peripheral: PMU, signal: 'gnd, 8', pin_signal: GND8}
  - {pin_num: D3, peripheral: PMU, signal: 'gnd, 9', pin_signal: GND9}
  - {pin_num: D6, peripheral: PMU, signal: 'gnd, 10', pin_signal: GND10}
  - {pin_num: D8, peripheral: PMU, signal: 'gnd, 11', pin_signal: GND11}
  - {pin_num: E5, peripheral: PMU, signal: 'gnd, 12', pin_signal: GND12}
  - {pin_num: E6, peripheral: PMU, signal: 'gnd, 13', pin_signal: GND13}
  - {pin_num: E7, peripheral: PMU, signal: 'gnd, 14', pin_signal: GND14}
  - {pin_num: F5, peripheral: PMU, signal: 'gnd, 15', pin_signal: GND15}
  - {pin_num: F6, peripheral: PMU, signal: 'gnd, 16', pin_signal: GND16}
  - {pin_num: F7, peripheral: PMU, signal: 'gnd, 17', pin_signal: GND17}
  - {pin_num: F8, peripheral: PMU, signal: 'gnd, 18', pin_signal: GND18}
  - {pin_num: G3, peripheral: PMU, signal: 'gnd, 19', pin_signal: GND19}
  - {pin_num: G10, peripheral: PMU, signal: 'gnd, 20', pin_signal: GND20}
  - {pin_num: G19, peripheral: PMU, signal: 'gnd, 21', pin_signal: GND21}
  - {pin_num: H8, peripheral: PMU, signal: 'gnd, 22', pin_signal: GND22}
  - {pin_num: H12, peripheral: PMU, signal: 'gnd, 23', pin_signal: GND23}
  - {pin_num: H15, peripheral: PMU, signal: 'gnd, 24', pin_signal: GND24}
  - {pin_num: H18, peripheral: PMU, signal: 'gnd, 25', pin_signal: GND25}
  - {pin_num: J2, peripheral: PMU, signal: 'gnd, 26', pin_signal: GND26}
  - {pin_num: J8, peripheral: PMU, signal: 'gnd, 27', pin_signal: GND27}
  - {pin_num: J12, peripheral: PMU, signal: 'gnd, 28', pin_signal: GND28}
  - {pin_num: J15, peripheral: PMU, signal: 'gnd, 29', pin_signal: GND29}
  - {pin_num: J18, peripheral: PMU, signal: 'gnd, 30', pin_signal: GND30}
  - {pin_num: K8, peripheral: PMU, signal: 'gnd, 31', pin_signal: GND31}
  - {pin_num: K10, peripheral: PMU, signal: 'gnd, 32', pin_signal: GND32}
  - {pin_num: K12, peripheral: PMU, signal: 'gnd, 33', pin_signal: GND33}
  - {pin_num: K15, peripheral: PMU, signal: 'gnd, 34', pin_signal: GND34}
  - {pin_num: K18, peripheral: PMU, signal: 'gnd, 35', pin_signal: GND35}
  - {pin_num: L2, peripheral: PMU, signal: 'gnd, 36', pin_signal: GND36}
  - {pin_num: L5, peripheral: PMU, signal: 'gnd, 37', pin_signal: GND37}
  - {pin_num: L8, peripheral: PMU, signal: 'gnd, 38', pin_signal: GND38}
  - {pin_num: L10, peripheral: PMU, signal: 'gnd, 39', pin_signal: GND39}
  - {pin_num: L12, peripheral: PMU, signal: 'gnd, 40', pin_signal: GND40}
  - {pin_num: L15, peripheral: PMU, signal: 'gnd, 41', pin_signal: GND41}
  - {pin_num: L18, peripheral: PMU, signal: 'gnd, 42', pin_signal: GND42}
  - {pin_num: M8, peripheral: PMU, signal: 'gnd, 43', pin_signal: GND43}
  - {pin_num: M10, peripheral: PMU, signal: 'gnd, 44', pin_signal: GND44}
  - {pin_num: M12, peripheral: PMU, signal: 'gnd, 45', pin_signal: GND45}
  - {pin_num: M15, peripheral: PMU, signal: 'gnd, 46', pin_signal: GND46}
  - {pin_num: M18, peripheral: PMU, signal: 'gnd, 47', pin_signal: GND47}
  - {pin_num: N8, peripheral: PMU, signal: 'gnd, 48', pin_signal: GND48}
  - {pin_num: N10, peripheral: PMU, signal: 'gnd, 49', pin_signal: GND49}
  - {pin_num: N15, peripheral: PMU, signal: 'gnd, 50', pin_signal: GND50}
  - {pin_num: N18, peripheral: PMU, signal: 'gnd, 51', pin_signal: GND51}
  - {pin_num: P8, peripheral: PMU, signal: 'gnd, 52', pin_signal: GND52}
  - {pin_num: P10, peripheral: PMU, signal: 'gnd, 53', pin_signal: GND53}
  - {pin_num: P12, peripheral: PMU, signal: 'gnd, 54', pin_signal: GND54}
  - {pin_num: P15, peripheral: PMU, signal: 'gnd, 55', pin_signal: GND55}
  - {pin_num: P18, peripheral: PMU, signal: 'gnd, 56', pin_signal: GND56}
  - {pin_num: R8, peripheral: PMU, signal: 'gnd, 57', pin_signal: GND57}
  - {pin_num: R12, peripheral: PMU, signal: 'gnd, 58', pin_signal: GND58}
  - {pin_num: R15, peripheral: PMU, signal: 'gnd, 59', pin_signal: GND59}
  - {pin_num: R17, peripheral: PMU, signal: 'gnd, 60', pin_signal: GND60}
  - {pin_num: T8, peripheral: PMU, signal: 'gnd, 61', pin_signal: GND61}
  - {pin_num: T11, peripheral: PMU, signal: 'gnd, 62', pin_signal: GND62}
  - {pin_num: T12, peripheral: PMU, signal: 'gnd, 63', pin_signal: GND63}
  - {pin_num: T15, peripheral: PMU, signal: 'gnd, 64', pin_signal: GND64}
  - {pin_num: T17, peripheral: PMU, signal: 'gnd, 65', pin_signal: GND65}
  - {pin_num: T19, peripheral: PMU, signal: 'gnd, 66', pin_signal: GND66}
  - {pin_num: U8, peripheral: PMU, signal: 'gnd, 67', pin_signal: GND67}
  - {pin_num: U11, peripheral: PMU, signal: 'gnd, 68', pin_signal: GND68}
  - {pin_num: U12, peripheral: PMU, signal: 'gnd, 69', pin_signal: GND69}
  - {pin_num: U15, peripheral: PMU, signal: 'gnd, 70', pin_signal: GND70}
  - {pin_num: U17, peripheral: PMU, signal: 'gnd, 71', pin_signal: GND71}
  - {pin_num: U19, peripheral: PMU, signal: 'gnd, 72', pin_signal: GND72}
  - {pin_num: V8, peripheral: PMU, signal: 'gnd, 73', pin_signal: GND73}
  - {pin_num: V19, peripheral: PMU, signal: 'gnd, 74', pin_signal: GND74}
  - {pin_num: W3, peripheral: PMU, signal: 'gnd, 75', pin_signal: GND75}
  - {pin_num: W7, peripheral: PMU, signal: 'gnd, 76', pin_signal: GND76}
  - {pin_num: W8, peripheral: PMU, signal: 'gnd, 77', pin_signal: GND77}
  - {pin_num: W9, peripheral: PMU, signal: 'gnd, 78', pin_signal: GND78}
  - {pin_num: W10, peripheral: PMU, signal: 'gnd, 79', pin_signal: GND79}
  - {pin_num: W11, peripheral: PMU, signal: 'gnd, 80', pin_signal: GND80}
  - {pin_num: W12, peripheral: PMU, signal: 'gnd, 81', pin_signal: GND81}
  - {pin_num: W13, peripheral: PMU, signal: 'gnd, 82', pin_signal: GND82}
  - {pin_num: W15, peripheral: PMU, signal: 'gnd, 83', pin_signal: GND83}
  - {pin_num: W16, peripheral: PMU, signal: 'gnd, 84', pin_signal: GND84}
  - {pin_num: W17, peripheral: PMU, signal: 'gnd, 85', pin_signal: GND85}
  - {pin_num: W18, peripheral: PMU, signal: 'gnd, 86', pin_signal: GND86}
  - {pin_num: W19, peripheral: PMU, signal: 'gnd, 87', pin_signal: GND87}
  - {pin_num: Y5, peripheral: PMU, signal: 'gnd, 88', pin_signal: GND88}
  - {pin_num: Y24, peripheral: PMU, signal: 'gnd, 89', pin_signal: GND89}
  - {pin_num: AA7, peripheral: PMU, signal: 'gnd, 90', pin_signal: GND90}
  - {pin_num: AA10, peripheral: PMU, signal: 'gnd, 91', pin_signal: GND91}
  - {pin_num: AA13, peripheral: PMU, signal: 'gnd, 92', pin_signal: GND92}
  - {pin_num: AA16, peripheral: PMU, signal: 'gnd, 93', pin_signal: GND93}
  - {pin_num: AA19, peripheral: PMU, signal: 'gnd, 94', pin_signal: GND94}
  - {pin_num: AA22, peripheral: PMU, signal: 'gnd, 95', pin_signal: GND95}
  - {pin_num: AB3, peripheral: PMU, signal: 'gnd, 96', pin_signal: GND96}
  - {pin_num: AB24, peripheral: PMU, signal: 'gnd, 97', pin_signal: GND97}
  - {pin_num: AD4, peripheral: PMU, signal: 'gnd, 98', pin_signal: GND98}
  - {pin_num: AD7, peripheral: PMU, signal: 'gnd, 99', pin_signal: GND99}
  - {pin_num: AD10, peripheral: PMU, signal: 'gnd, 100', pin_signal: GND100}
  - {pin_num: AD13, peripheral: PMU, signal: 'gnd, 101', pin_signal: GND101}
  - {pin_num: AD16, peripheral: PMU, signal: 'gnd, 102', pin_signal: GND102}
  - {pin_num: AD19, peripheral: PMU, signal: 'gnd, 103', pin_signal: GND103}
  - {pin_num: AD22, peripheral: PMU, signal: 'gnd, 104', pin_signal: GND104}
  - {pin_num: AE1, peripheral: PMU, signal: 'gnd, 105', pin_signal: GND105}
  - {pin_num: AE25, peripheral: PMU, signal: 'gnd, 106', pin_signal: GND106}
  - {pin_num: A4, peripheral: PMU, signal: 'gnd, 0', pin_signal: GND0}
  - {pin_num: R10, peripheral: PMU, signal: 'vdd_soc_cap, 0', pin_signal: VDDSOC_CAP0}
  - {pin_num: T10, peripheral: PMU, signal: 'vdd_soc_cap, 1', pin_signal: VDDSOC_CAP1}
  - {pin_num: T13, peripheral: PMU, signal: 'vdd_soc_cap, 2', pin_signal: VDDSOC_CAP2}
  - {pin_num: T14, peripheral: PMU, signal: 'vdd_soc_cap, 3', pin_signal: VDDSOC_CAP3}
  - {pin_num: U10, peripheral: PMU, signal: 'vdd_soc_cap, 4', pin_signal: VDDSOC_CAP4}
  - {pin_num: U13, peripheral: PMU, signal: 'vdd_soc_cap, 5', pin_signal: VDDSOC_CAP5}
  - {pin_num: U14, peripheral: PMU, signal: 'vdd_soc_cap, 6', pin_signal: VDDSOC_CAP6}
  - {pin_num: H16, peripheral: PMU, signal: 'vdd_soc_in, 0', pin_signal: VDDSOC_IN0}
  - {pin_num: J16, peripheral: PMU, signal: 'vdd_soc_in, 1', pin_signal: VDDSOC_IN1}
  - {pin_num: K16, peripheral: PMU, signal: 'vdd_soc_in, 2', pin_signal: VDDSOC_IN2}
  - {pin_num: L16, peripheral: PMU, signal: 'vdd_soc_in, 3', pin_signal: VDDSOC_IN3}
  - {pin_num: M16, peripheral: PMU, signal: 'vdd_soc_in, 4', pin_signal: VDDSOC_IN4}
  - {pin_num: N16, peripheral: PMU, signal: 'vdd_soc_in, 5', pin_signal: VDDSOC_IN5}
  - {pin_num: P16, peripheral: PMU, signal: 'vdd_soc_in, 6', pin_signal: VDDSOC_IN6}
  - {pin_num: R16, peripheral: PMU, signal: 'vdd_soc_in, 7', pin_signal: VDDSOC_IN7}
  - {pin_num: T16, peripheral: PMU, signal: 'vdd_soc_in, 8', pin_signal: VDDSOC_IN8}
  - {pin_num: U16, peripheral: PMU, signal: 'vdd_soc_in, 9', pin_signal: VDDSOC_IN9}
  - {pin_num: N12, peripheral: PMU, signal: vdd_cache_cap, pin_signal: VDD_CACHE_CAP}
  - {pin_num: G11, peripheral: PMU, signal: vdd_snvs_in, pin_signal: VDD_SNVS_IN}
  - {pin_num: G9, peripheral: PMU, signal: vdd_snvs_cap, pin_signal: VDD_SNVS_CAP}
  - {pin_num: H17, peripheral: PMU, signal: 'vdd_pu_cap, 0', pin_signal: VDDPU_CAP0}
  - {pin_num: J17, peripheral: PMU, signal: 'vdd_pu_cap, 1', pin_signal: VDDPU_CAP1}
  - {pin_num: K17, peripheral: PMU, signal: 'vdd_pu_cap, 2', pin_signal: VDDPU_CAP2}
  - {pin_num: L17, peripheral: PMU, signal: 'vdd_pu_cap, 3', pin_signal: VDDPU_CAP3}
  - {pin_num: M17, peripheral: PMU, signal: 'vdd_pu_cap, 4', pin_signal: VDDPU_CAP4}
  - {pin_num: N17, peripheral: PMU, signal: 'vdd_pu_cap, 5', pin_signal: VDDPU_CAP5}
  - {pin_num: P17, peripheral: PMU, signal: 'vdd_pu_cap, 6', pin_signal: VDDPU_CAP6}
  - {pin_num: H9, peripheral: PMU, signal: 'vdd_high_in, 0', pin_signal: VDDHIGH_IN0}
  - {pin_num: J9, peripheral: PMU, signal: 'vdd_high_in, 1', pin_signal: VDDHIGH_IN1}
  - {pin_num: H10, peripheral: PMU, signal: 'vdd_high_cap, 0', pin_signal: VDDHIGH_CAP0}
  - {pin_num: J10, peripheral: PMU, signal: 'vdd_high_cap, 1', pin_signal: VDDHIGH_CAP1}
  - {pin_num: H14, peripheral: PMU, signal: 'vdd_arm_in, 0', pin_signal: VDDARM_IN0}
  - {pin_num: J14, peripheral: PMU, signal: 'vdd_arm_in, 1', pin_signal: VDDARM_IN1}
  - {pin_num: K14, peripheral: PMU, signal: 'vdd_arm_in, 2', pin_signal: VDDARM_IN2}
  - {pin_num: L14, peripheral: PMU, signal: 'vdd_arm_in, 3', pin_signal: VDDARM_IN3}
  - {pin_num: M14, peripheral: PMU, signal: 'vdd_arm_in, 4', pin_signal: VDDARM_IN4}
  - {pin_num: N14, peripheral: PMU, signal: 'vdd_arm_in, 5', pin_signal: VDDARM_IN5}
