ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
  - {pin_num: P14, peripheral: PMU, signal: 'vdd_arm_in, 6', pin_signal: VDDARM_IN6}
  - {pin_num: R14, peripheral: PMU, signal: 'vdd_arm_in, 7', pin_signal: VDDARM_IN7}
  - {pin_num: H13, peripheral: PMU, signal: 'vdd_arm_cap, 0', pin_signal: VDDARM_CAP0}
  - {pin_num: J13, peripheral: PMU, signal: 'vdd_arm_cap, 1', pin_signal: VDDARM_CAP1}
  - {pin_num: K13, peripheral: PMU, signal: 'vdd_arm_cap, 2', pin_signal: VDDARM_CAP2}
  - {pin_num: L13, peripheral: PMU, signal: 'vdd_arm_cap, 3', pin_signal: VDDARM_CAP3}
  - {pin_num: M13, peripheral: PMU, signal: 'vdd_arm_cap, 4', pin_signal: VDDARM_CAP4}
  - {pin_num: N13, peripheral: PMU, signal: 'vdd_arm_cap, 5', pin_signal: VDDARM_CAP5}
  - {pin_num: P13, peripheral: PMU, signal: 'vdd_arm_cap, 6', pin_signal: VDDARM_CAP6}
  - {pin_num: R13, peripheral: PMU, signal: 'vdd_arm_cap, 7', pin_signal: VDDARM_CAP7}
  - {pin_num: K9, peripheral: PMU, signal: 'vdd_arm23_in, 0', pin_signal: VDDARM23_IN0}
  - {pin_num: L9, peripheral: PMU, signal: 'vdd_arm23_in, 1', pin_signal: VDDARM23_IN1}
  - {pin_num: M9, peripheral: PMU, signal: 'vdd_arm23_in, 2', pin_signal: VDDARM23_IN2}
  - {pin_num: N9, peripheral: PMU, signal: 'vdd_arm23_in, 3', pin_signal: VDDARM23_IN3}
  - {pin_num: P9, peripheral: PMU, signal: 'vdd_arm23_in, 4', pin_signal: VDDARM23_IN4}
  - {pin_num: R9, peripheral: PMU, signal: 'vdd_arm23_in, 5', pin_signal: VDDARM23_IN5}
  - {pin_num: T9, peripheral: PMU, signal: 'vdd_arm23_in, 6', pin_signal: VDDARM23_IN6}
  - {pin_num: U9, peripheral: PMU, signal: 'vdd_arm23_in, 7', pin_signal: VDDARM23_IN7}
  - {pin_num: H11, peripheral: PMU, signal: 'vdd_arm23_cap, 0', pin_signal: VDDARM23_CAP0}
  - {pin_num: J11, peripheral: PMU, signal: 'vdd_arm23_cap, 1', pin_signal: VDDARM23_CAP1}
  - {pin_num: K11, peripheral: PMU, signal: 'vdd_arm23_cap, 2', pin_signal: VDDARM23_CAP2}
  - {pin_num: L11, peripheral: PMU, signal: 'vdd_arm23_cap, 3', pin_signal: VDDARM23_CAP3}
  - {pin_num: M11, peripheral: PMU, signal: 'vdd_arm23_cap, 4', pin_signal: VDDARM23_CAP4}
  - {pin_num: N11, peripheral: PMU, signal: 'vdd_arm23_cap, 5', pin_signal: VDDARM23_CAP5}
  - {pin_num: P11, peripheral: PMU, signal: 'vdd_arm23_cap, 6', pin_signal: VDDARM23_CAP6}
  - {pin_num: R11, peripheral: PMU, signal: 'vdd_arm23_cap, 7', pin_signal: VDDARM23_CAP7}
  - {pin_num: P19, peripheral: PMU, signal: nvcc_lcd, pin_signal: NVCC_LCD}
  - {pin_num: N7, peripheral: PMU, signal: nvcc_csi, pin_signal: NVCC_CSI}
  - {pin_num: K7, peripheral: PMU, signal: nvcc_mipi, pin_signal: NVCC_MIPI}
  - {pin_num: K19, peripheral: PMU, signal: nvcc_eim0, pin_signal: NVCC_EIM0}
  - {pin_num: L19, peripheral: PMU, signal: nvcc_eim1, pin_signal: NVCC_EIM1}
  - {pin_num: M19, peripheral: PMU, signal: nvcc_eim2, pin_signal: NVCC_EIM2}
  - {pin_num: P7, peripheral: PMU, signal: nvcc_gpio, pin_signal: NVCC_GPIO}
  - {pin_num: R19, peripheral: PMU, signal: nvcc_enet, pin_signal: NVCC_ENET}
  - {pin_num: E8, peripheral: PMU, signal: nvcc_pll_out, pin_signal: NVCC_PLL_OUT}
  - {pin_num: G18, peripheral: PMU, signal: nvcc_rgmii, pin_signal: NVCC_RGMII}
  - {pin_num: G16, peripheral: PMU, signal: nvcc_sd1, pin_signal: NVCC_SD1}
  - {pin_num: G17, peripheral: PMU, signal: nvcc_sd2, pin_signal: NVCC_SD2}
  - {pin_num: G14, peripheral: PMU, signal: nvcc_sd3, pin_signal: NVCC_SD3}
  - {pin_num: G15, peripheral: PMU, signal: nvcc_nand, pin_signal: NVCC_NANDF}
  - {pin_num: J7, peripheral: PMU, signal: nvcc_jtag, pin_signal: NVCC_JTAG}
  - {pin_num: AB14, peripheral: MMDC, signal: 'dram_a, 1', pin_signal: DRAM_A1}
  - {pin_num: AC14, peripheral: MMDC, signal: 'dram_a, 0', pin_signal: DRAM_A0}
  - {pin_num: AA14, peripheral: MMDC, signal: 'dram_a, 2', pin_signal: DRAM_A2}
  - {pin_num: Y14, peripheral: MMDC, signal: 'dram_a, 3', pin_signal: DRAM_A3}
  - {pin_num: W14, peripheral: MMDC, signal: 'dram_a, 4', pin_signal: DRAM_A4}
  - {pin_num: AE13, peripheral: MMDC, signal: 'dram_a, 5', pin_signal: DRAM_A5}
  - {pin_num: AC13, peripheral: MMDC, signal: 'dram_a, 6', pin_signal: DRAM_A6}
  - {pin_num: Y13, peripheral: MMDC, signal: 'dram_a, 7', pin_signal: DRAM_A7}
  - {pin_num: AB13, peripheral: MMDC, signal: 'dram_a, 8', pin_signal: DRAM_A8}
  - {pin_num: AE12, peripheral: MMDC, signal: 'dram_a, 9', pin_signal: DRAM_A9}
  - {pin_num: AA15, peripheral: MMDC, signal: 'dram_a, 10', pin_signal: DRAM_A10}
  - {pin_num: AC12, peripheral: MMDC, signal: 'dram_a, 11', pin_signal: DRAM_A11}
  - {pin_num: AD12, peripheral: MMDC, signal: 'dram_a, 12', pin_signal: DRAM_A12}
  - {pin_num: AC17, peripheral: MMDC, signal: 'dram_a, 13', pin_signal: DRAM_A13}
  - {pin_num: AA12, peripheral: MMDC, signal: 'dram_a, 14', pin_signal: DRAM_A14}
  - {pin_num: Y12, peripheral: MMDC, signal: 'dram_a, 15', pin_signal: DRAM_A15}
  - {pin_num: AE16, peripheral: MMDC, signal: dram_cas, pin_signal: DRAM_CAS}
  - {pin_num: Y16, peripheral: MMDC, signal: 'dram_cs, 0', pin_signal: DRAM_CS0}
  - {pin_num: AD2, peripheral: MMDC, signal: 'dram_d, 0', pin_signal: DRAM_D0}
  - {pin_num: AE2, peripheral: MMDC, signal: 'dram_d, 1', pin_signal: DRAM_D1}
  - {pin_num: AC4, peripheral: MMDC, signal: 'dram_d, 2', pin_signal: DRAM_D2}
  - {pin_num: AA5, peripheral: MMDC, signal: 'dram_d, 3', pin_signal: DRAM_D3}
  - {pin_num: AC1, peripheral: MMDC, signal: 'dram_d, 4', pin_signal: DRAM_D4}
  - {pin_num: AD1, peripheral: MMDC, signal: 'dram_d, 5', pin_signal: DRAM_D5}
  - {pin_num: AB4, peripheral: MMDC, signal: 'dram_d, 6', pin_signal: DRAM_D6}
  - {pin_num: AE4, peripheral: MMDC, signal: 'dram_d, 7', pin_signal: DRAM_D7}
  - {pin_num: AD5, peripheral: MMDC, signal: 'dram_d, 8', pin_signal: DRAM_D8}
  - {pin_num: AE5, peripheral: MMDC, signal: 'dram_d, 9', pin_signal: DRAM_D9}
  - {pin_num: AA6, peripheral: MMDC, signal: 'dram_d, 10', pin_signal: DRAM_D10}
  - {pin_num: AE7, peripheral: MMDC, signal: 'dram_d, 11', pin_signal: DRAM_D11}
  - {pin_num: AB5, peripheral: MMDC, signal: 'dram_d, 12', pin_signal: DRAM_D12}
  - {pin_num: AC5, peripheral: MMDC, signal: 'dram_d, 13', pin_signal: DRAM_D13}
  - {pin_num: AB6, peripheral: MMDC, signal: 'dram_d, 14', pin_signal: DRAM_D14}
  - {pin_num: AC7, peripheral: MMDC, signal: 'dram_d, 15', pin_signal: DRAM_D15}
  - {pin_num: AB7, peripheral: MMDC, signal: 'dram_d, 16', pin_signal: DRAM_D16}
  - {pin_num: AA8, peripheral: MMDC, signal: 'dram_d, 17', pin_signal: DRAM_D17}
  - {pin_num: AB9, peripheral: MMDC, signal: 'dram_d, 18', pin_signal: DRAM_D18}
  - {pin_num: Y9, peripheral: MMDC, signal: 'dram_d, 19', pin_signal: DRAM_D19}
  - {pin_num: Y7, peripheral: MMDC, signal: 'dram_d, 20', pin_signal: DRAM_D20}
  - {pin_num: Y8, peripheral: MMDC, signal: 'dram_d, 21', pin_signal: DRAM_D21}
  - {pin_num: AC8, peripheral: MMDC, signal: 'dram_d, 22', pin_signal: DRAM_D22}
  - {pin_num: AA9, peripheral: MMDC, signal: 'dram_d, 23', pin_signal: DRAM_D23}
  - {pin_num: AE9, peripheral: MMDC, signal: 'dram_d, 24', pin_signal: DRAM_D24}
  - {pin_num: Y10, peripheral: MMDC, signal: 'dram_d, 25', pin_signal: DRAM_D25}
  - {pin_num: AE11, peripheral: MMDC, signal: 'dram_d, 26', pin_signal: DRAM_D26}
  - {pin_num: AB11, peripheral: MMDC, signal: 'dram_d, 27', pin_signal: DRAM_D27}
  - {pin_num: AC9, peripheral: MMDC, signal: 'dram_d, 28', pin_signal: DRAM_D28}
  - {pin_num: AD9, peripheral: MMDC, signal: 'dram_d, 29', pin_signal: DRAM_D29}
  - {pin_num: AD11, peripheral: MMDC, signal: 'dram_d, 30', pin_signal: DRAM_D30}
  - {pin_num: AC11, peripheral: MMDC, signal: 'dram_d, 31', pin_signal: DRAM_D31}
  - {pin_num: AA17, peripheral: MMDC, signal: 'dram_d, 32', pin_signal: DRAM_D32}
  - {pin_num: AA18, peripheral: MMDC, signal: 'dram_d, 33', pin_signal: DRAM_D33}
  - {pin_num: AC18, peripheral: MMDC, signal: 'dram_d, 34', pin_signal: DRAM_D34}
  - {pin_num: AE19, peripheral: MMDC, signal: 'dram_d, 35', pin_signal: DRAM_D35}
  - {pin_num: Y17, peripheral: MMDC, signal: 'dram_d, 36', pin_signal: DRAM_D36}
  - {pin_num: Y18, peripheral: MMDC, signal: 'dram_d, 37', pin_signal: DRAM_D37}
  - {pin_num: AB19, peripheral: MMDC, signal: 'dram_d, 38', pin_signal: DRAM_D38}
  - {pin_num: AC19, peripheral: MMDC, signal: 'dram_d, 39', pin_signal: DRAM_D39}
  - {pin_num: Y19, peripheral: MMDC, signal: 'dram_d, 40', pin_signal: DRAM_D40}
  - {pin_num: AB20, peripheral: MMDC, signal: 'dram_d, 41', pin_signal: DRAM_D41}
  - {pin_num: AB21, peripheral: MMDC, signal: 'dram_d, 42', pin_signal: DRAM_D42}
  - {pin_num: AD21, peripheral: MMDC, signal: 'dram_d, 43', pin_signal: DRAM_D43}
  - {pin_num: Y20, peripheral: MMDC, signal: 'dram_d, 44', pin_signal: DRAM_D44}
  - {pin_num: AA20, peripheral: MMDC, signal: 'dram_d, 45', pin_signal: DRAM_D45}
  - {pin_num: AE21, peripheral: MMDC, signal: 'dram_d, 46', pin_signal: DRAM_D46}
  - {pin_num: AC21, peripheral: MMDC, signal: 'dram_d, 47', pin_signal: DRAM_D47}
  - {pin_num: AC22, peripheral: MMDC, signal: 'dram_d, 48', pin_signal: DRAM_D48}
  - {pin_num: AE22, peripheral: MMDC, signal: 'dram_d, 49', pin_signal: DRAM_D49}
  - {pin_num: AE24, peripheral: MMDC, signal: 'dram_d, 50', pin_signal: DRAM_D50}
  - {pin_num: AC24, peripheral: MMDC, signal: 'dram_d, 51', pin_signal: DRAM_D51}
  - {pin_num: AB22, peripheral: MMDC, signal: 'dram_d, 52', pin_signal: DRAM_D52}
  - {pin_num: AC23, peripheral: MMDC, signal: 'dram_d, 53', pin_signal: DRAM_D53}
  - {pin_num: AD25, peripheral: MMDC, signal: 'dram_d, 54', pin_signal: DRAM_D54}
  - {pin_num: AC25, peripheral: MMDC, signal: 'dram_d, 55', pin_signal: DRAM_D55}
  - {pin_num: AB25, peripheral: MMDC, signal: 'dram_d, 56', pin_signal: DRAM_D56}
  - {pin_num: AA21, peripheral: MMDC, signal: 'dram_d, 57', pin_signal: DRAM_D57}
  - {pin_num: Y25, peripheral: MMDC, signal: 'dram_d, 58', pin_signal: DRAM_D58}
  - {pin_num: Y22, peripheral: MMDC, signal: 'dram_d, 59', pin_signal: DRAM_D59}
  - {pin_num: AB23, peripheral: MMDC, signal: 'dram_d, 60', pin_signal: DRAM_D60}
  - {pin_num: AA23, peripheral: MMDC, signal: 'dram_d, 61', pin_signal: DRAM_D61}
  - {pin_num: Y23, peripheral: MMDC, signal: 'dram_d, 62', pin_signal: DRAM_D62}
  - {pin_num: W25, peripheral: MMDC, signal: 'dram_d, 63', pin_signal: DRAM_D63}
  - {pin_num: AC3, peripheral: MMDC, signal: 'dram_dqm, 0', pin_signal: DRAM_DQM0}
  - {pin_num: AC6, peripheral: MMDC, signal: 'dram_dqm, 1', pin_signal: DRAM_DQM1}
  - {pin_num: AB8, peripheral: MMDC, signal: 'dram_dqm, 2', pin_signal: DRAM_DQM2}
  - {pin_num: AE10, peripheral: MMDC, signal: 'dram_dqm, 3', pin_signal: DRAM_DQM3}
  - {pin_num: AB18, peripheral: MMDC, signal: 'dram_dqm, 4', pin_signal: DRAM_DQM4}
  - {pin_num: AC20, peripheral: MMDC, signal: 'dram_dqm, 5', pin_signal: DRAM_DQM5}
  - {pin_num: AD24, peripheral: MMDC, signal: 'dram_dqm, 6', pin_signal: DRAM_DQM6}
  - {pin_num: Y21, peripheral: MMDC, signal: 'dram_dqm, 7', pin_signal: DRAM_DQM7}
  - {pin_num: AB15, peripheral: MMDC, signal: dram_ras, pin_signal: DRAM_RAS}
  - {pin_num: Y6, peripheral: MMDC, signal: dram_reset, pin_signal: DRAM_RESET}
  - {pin_num: AC15, peripheral: MMDC, signal: 'dram_sdba, 0', pin_signal: DRAM_SDBA0}
  - {pin_num: Y15, peripheral: MMDC, signal: 'dram_sdba, 1', pin_signal: DRAM_SDBA1}
  - {pin_num: AB12, peripheral: MMDC, signal: 'dram_sdba, 2', pin_signal: DRAM_SDBA2}
  - {pin_num: R18, peripheral: PMU, signal: 'nvcc_dram, 0', pin_signal: NVCC_DRAM0}
  - {pin_num: T18, peripheral: PMU, signal: 'nvcc_dram, 1', pin_signal: NVCC_DRAM1}
  - {pin_num: U18, peripheral: PMU, signal: 'nvcc_dram, 2', pin_signal: NVCC_DRAM2}
  - {pin_num: V9, peripheral: PMU, signal: 'nvcc_dram, 3', pin_signal: NVCC_DRAM3}
  - {pin_num: V10, peripheral: PMU, signal: 'nvcc_dram, 4', pin_signal: NVCC_DRAM4}
  - {pin_num: V11, peripheral: PMU, signal: 'nvcc_dram, 5', pin_signal: NVCC_DRAM5}
  - {pin_num: V12, peripheral: PMU, signal: 'nvcc_dram, 6', pin_signal: NVCC_DRAM6}
  - {pin_num: V13, peripheral: PMU, signal: 'nvcc_dram, 7', pin_signal: NVCC_DRAM7}
  - {pin_num: V14, peripheral: PMU, signal: 'nvcc_dram, 8', pin_signal: NVCC_DRAM8}
  - {pin_num: V15, peripheral: PMU, signal: 'nvcc_dram, 9', pin_signal: NVCC_DRAM9}
  - {pin_num: V16, peripheral: PMU, signal: 'nvcc_dram, 10', pin_signal: NVCC_DRAM10}
  - {pin_num: V17, peripheral: PMU, signal: 'nvcc_dram, 11', pin_signal: NVCC_DRAM11}
  - {pin_num: V18, peripheral: PMU, signal: 'nvcc_dram, 12', pin_signal: NVCC_DRAM12}
  - {pin_num: Y11, peripheral: MMDC, signal: 'dram_sdcke, 0', pin_signal: DRAM_SDCKE0}
  - {pin_num: AD15, peripheral: MMDC, signal: dram_sdclk_0, pin_signal: DRAM_SDCLK_0}
  - {pin_num: AE15, peripheral: MMDC, signal: dram_sdclk_0_b, pin_signal: DRAM_SDCLK_0_B}
  - {pin_num: AC16, peripheral: MMDC, signal: 'dram_odt, 0', pin_signal: DRAM_SDODT0}
  - {pin_num: AD14, peripheral: MMDC, signal: dram_sdclk_1, pin_signal: DRAM_SDCLK_1}
  - {pin_num: AE14, peripheral: MMDC, signal: dram_sdclk_1_b, pin_signal: DRAM_SDCLK_1_B}
  - {pin_num: AE3, peripheral: MMDC, signal: 'dram_sdqs, 0', pin_signal: DRAM_SDQS0}
  - {pin_num: AD3, peripheral: MMDC, signal: 'dram_sdqs_b, 0', pin_signal: DRAM_SDQS0_B}
  - {pin_num: AD6, peripheral: MMDC, signal: 'dram_sdqs, 1', pin_signal: DRAM_SDQS1}
  - {pin_num: AE6, peripheral: MMDC, signal: 'dram_sdqs_b, 1', pin_signal: DRAM_SDQS1_B}
  - {pin_num: AD8, peripheral: MMDC, signal: 'dram_sdqs, 2', pin_signal: DRAM_SDQS2}
  - {pin_num: AE8, peripheral: MMDC, signal: 'dram_sdqs_b, 2', pin_signal: DRAM_SDQS2_B}
  - {pin_num: AC10, peripheral: MMDC, signal: 'dram_sdqs, 3', pin_signal: DRAM_SDQS3}
  - {pin_num: AB10, peripheral: MMDC, signal: 'dram_sdqs_b, 3', pin_signal: DRAM_SDQS3_B}
  - {pin_num: AD18, peripheral: MMDC, signal: 'dram_sdqs, 4', pin_signal: DRAM_SDQS4}
  - {pin_num: AE18, peripheral: MMDC, signal: 'dram_sdqs_b, 4', pin_signal: DRAM_SDQS4_B}
  - {pin_num: AD20, peripheral: MMDC, signal: 'dram_sdqs, 5', pin_signal: DRAM_SDQS5}
  - {pin_num: AE20, peripheral: MMDC, signal: 'dram_sdqs_b, 5', pin_signal: DRAM_SDQS5_B}
  - {pin_num: AD23, peripheral: MMDC, signal: 'dram_sdqs, 6', pin_signal: DRAM_SDQS6}
  - {pin_num: AE23, peripheral: MMDC, signal: 'dram_sdqs_b, 6', pin_signal: DRAM_SDQS6_B}
  - {pin_num: AA25, peripheral: MMDC, signal: 'dram_sdqs, 7', pin_signal: DRAM_SDQS7}
  - {pin_num: AA24, peripheral: MMDC, signal: 'dram_sdqs_b, 7', pin_signal: DRAM_SDQS7_B}
  - {pin_num: AC2, peripheral: PMU, signal: dram_vref, pin_signal: DRAM_VREF}
  - {pin_num: AB16, peripheral: MMDC, signal: dram_sdwe, pin_signal: DRAM_SDWE}
  - {pin_num: AE17, peripheral: PMU, signal: zqpad, pin_signal: ZQPAD}
  - {pin_num: H25, peripheral: SRC, signal: 'bt_cfg, 16', pin_signal: EIM_A16}
  - {pin_num: G24, peripheral: SRC, signal: 'bt_cfg, 17', pin_signal: EIM_A17}
  - {pin_num: J22, peripheral: SRC, signal: 'bt_cfg, 18', pin_signal: EIM_A18}
  - {pin_num: G25, peripheral: SRC, signal: 'bt_cfg, 19', pin_signal: EIM_A19}
  - {pin_num: H22, peripheral: SRC, signal: 'bt_cfg, 20', pin_signal: EIM_A20}
  - {pin_num: H23, peripheral: SRC, signal: 'bt_cfg, 21', pin_signal: EIM_A21}
  - {pin_num: F24, peripheral: SRC, signal: 'bt_cfg, 22', pin_signal: EIM_A22}
  - {pin_num: J21, peripheral: SRC, signal: 'bt_cfg, 23', pin_signal: EIM_A23}
  - {pin_num: F25, peripheral: SRC, signal: 'bt_cfg, 24', pin_signal: EIM_A24}
  - {pin_num: K22, peripheral: SRC, signal: 'bt_cfg, 26', pin_signal: EIM_LBA}
  - {pin_num: K20, peripheral: SRC, signal: 'bt_cfg, 29', pin_signal: EIM_RW}
  - {pin_num: K21, peripheral: SRC, signal: 'bt_cfg, 27', pin_signal: EIM_EB0}
  - {pin_num: K23, peripheral: SRC, signal: 'bt_cfg, 28', pin_signal: EIM_EB1}
  - {pin_num: E22, peripheral: SRC, signal: 'bt_cfg, 30', pin_signal: EIM_EB2}
  - {pin_num: F23, peripheral: SRC, signal: 'bt_cfg, 31', pin_signal: EIM_EB3}
  - {pin_num: M25, peripheral: SRC, signal: 'bt_cfg, 25', pin_signal: EIM_WAIT}
  - {pin_num: L20, peripheral: SRC, signal: 'bt_cfg, 0', pin_signal: EIM_DA0}
  - {pin_num: J25, peripheral: SRC, signal: 'bt_cfg, 1', pin_signal: EIM_DA1}
  - {pin_num: L21, peripheral: SRC, signal: 'bt_cfg, 2', pin_signal: EIM_DA2}
  - {pin_num: K24, peripheral: SRC, signal: 'bt_cfg, 3', pin_signal: EIM_DA3}
  - {pin_num: L22, peripheral: SRC, signal: 'bt_cfg, 4', pin_signal: EIM_DA4}
  - {pin_num: L23, peripheral: SRC, signal: 'bt_cfg, 5', pin_signal: EIM_DA5}
  - {pin_num: K25, peripheral: SRC, signal: 'bt_cfg, 6', pin_signal: EIM_DA6}
  - {pin_num: L25, peripheral: SRC, signal: 'bt_cfg, 7', pin_signal: EIM_DA7}
  - {pin_num: L24, peripheral: SRC, signal: 'bt_cfg, 8', pin_signal: EIM_DA8}
  - {pin_num: M21, peripheral: SRC, signal: 'bt_cfg, 9', pin_signal: EIM_DA9}
  - {pin_num: M22, peripheral: SRC, signal: 'bt_cfg, 10', pin_signal: EIM_DA10}
  - {pin_num: M20, peripheral: SRC, signal: 'bt_cfg, 11', pin_signal: EIM_DA11}
  - {pin_num: M24, peripheral: SRC, signal: 'bt_cfg, 12', pin_signal: EIM_DA12}
  - {pin_num: M23, peripheral: SRC, signal: 'bt_cfg, 13', pin_signal: EIM_DA13}
  - {pin_num: N23, peripheral: SRC, signal: 'bt_cfg, 14', pin_signal: EIM_DA14}
  - {pin_num: N24, peripheral: SRC, signal: 'bt_cfg, 15', pin_signal: EIM_DA15}
  - {pin_num: U21, peripheral: ENET, signal: rx_en, pin_signal: ENET_CRS_DV}
  - {pin_num: V20, peripheral: ENET, signal: mdc, pin_signal: ENET_MDC}
  - {pin_num: V23, peripheral: ENET, signal: mdio, pin_signal: ENET_MDIO}
  - {pin_num: W21, peripheral: ENET, signal: 'rdata, 0', pin_signal: ENET_RXD0}
  - {pin_num: W22, peripheral: ENET, signal: 'rdata, 1', pin_signal: ENET_RXD1}
  - {pin_num: W23, peripheral: ENET, signal: rx_er, pin_signal: ENET_RX_ER}
  - {pin_num: U20, peripheral: ENET, signal: 'tdata, 0', pin_signal: ENET_TXD0}
  - {pin_num: W20, peripheral: ENET, signal: 'tdata, 1', pin_signal: ENET_TXD1}
  - {pin_num: V21, peripheral: ENET, signal: tx_en, pin_signal: ENET_TX_EN}
  - {pin_num: D14, peripheral: uSDHC3, signal: clk, pin_signal: SD3_CLK}
  - {pin_num: B13, peripheral: uSDHC3, signal: cmd, pin_signal: SD3_CMD}
  - {pin_num: E14, peripheral: uSDHC3, signal: dat0, pin_signal: SD3_DAT0}
  - {pin_num: F14, peripheral: uSDHC3, signal: dat1, pin_signal: SD3_DAT1}
