ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
  - {pin_num: A15, peripheral: uSDHC3, signal: dat2, pin_signal: SD3_DAT2}
  - {pin_num: B15, peripheral: uSDHC3, signal: dat3, pin_signal: SD3_DAT3}
  - {pin_num: D13, peripheral: uSDHC3, signal: dat4, pin_signal: SD3_DAT4}
  - {pin_num: C13, peripheral: uSDHC3, signal: dat5, pin_signal: SD3_DAT5}
  - {pin_num: E13, peripheral: uSDHC3, signal: dat6, pin_signal: SD3_DAT6}
  - {pin_num: F13, peripheral: uSDHC3, signal: dat7, pin_signal: SD3_DAT7}
  - {pin_num: D15, peripheral: uSDHC3, signal: rst, pin_signal: SD3_RST}
  - {pin_num: D20, peripheral: uSDHC1, signal: clk, pin_signal: SD1_CLK}
  - {pin_num: D9, peripheral: XTALOSC, signal: rtc_xtali, pin_signal: RTC_XTALI}
  - {pin_num: C9, peripheral: XTALOSC, signal: rtc_xtalo, pin_signal: RTC_XTALO}
  - {pin_num: A7, peripheral: XTALOSC, signal: xtali, pin_signal: XTALI}
  - {pin_num: B7, peripheral: XTALOSC, signal: xtalo, pin_signal: XTALO}
  - {pin_num: H6, peripheral: SJC, signal: mod, pin_signal: JTAG_MOD}
  - {pin_num: H5, peripheral: SJC, signal: tck, pin_signal: JTAG_TCK}
  - {pin_num: G5, peripheral: SJC, signal: tdi, pin_signal: JTAG_TDI}
  - {pin_num: G6, peripheral: SJC, signal: tdo, pin_signal: JTAG_TDO}
  - {pin_num: C3, peripheral: SJC, signal: tms, pin_signal: JTAG_TMS}
  - {pin_num: C2, peripheral: SJC, signal: trstb, pin_signal: JTAG_TRSTB}
  - {pin_num: D12, peripheral: SRC, signal: onoff, pin_signal: ONOFF}
  - {pin_num: C11, peripheral: SRC, signal: por_b, pin_signal: POR_B}
  - {pin_num: E11, peripheral: SNVS, signal: snvs_td1, pin_signal: TAMPER}
  - {pin_num: D11, peripheral: SNVS, signal: snvs_wakeup_alarm, pin_signal: PMIC_ON_REQ}
  - {pin_num: F11, peripheral: CCM, signal: pmic_vstby_req, pin_signal: PMIC_STBY_REQ}
  - {pin_num: F9, peripheral: PMU, signal: vdd_usb_cap, pin_signal: VDDUSB_CAP}
  - {pin_num: D10, peripheral: PMU, signal: usb_h1_vbus, pin_signal: USB_H1_VBUS}
  - {pin_num: F10, peripheral: USB, signal: usb_h1_dn, pin_signal: USB_H1_DN}
  - {pin_num: E10, peripheral: USB, signal: usb_h1_dp, pin_signal: USB_H1_DP}
  - {pin_num: B6, peripheral: USB, signal: usb_otg_dn, pin_signal: USB_OTG_DN}
  - {pin_num: A6, peripheral: USB, signal: usb_otg_dp, pin_signal: USB_OTG_DP}
  - {pin_num: E9, peripheral: PMU, signal: usb_otg_vbus, pin_signal: USB_OTG_VBUS}
  - {pin_num: G13, peripheral: PMU, signal: sata_vp, pin_signal: SATA_VP}
  - {pin_num: G12, peripheral: PMU, signal: sata_vph, pin_signal: SATA_VPH}
  - {pin_num: H7, peripheral: PMU, signal: pcie_vp, pin_signal: PCIE_VP}
  - {pin_num: G8, peripheral: PMU, signal: pcie_vptx, pin_signal: PCIE_VPTX}
  - {pin_num: G7, peripheral: PMU, signal: pcie_vph, pin_signal: PCIE_VPH}
  - {pin_num: V4, peripheral: LDB, signal: lvds0_clk_n, pin_signal: LVDS0_CLK_N}
  - {pin_num: V3, peripheral: LDB, signal: lvds0_clk_p, pin_signal: LVDS0_CLK_P}
  - {pin_num: U2, peripheral: LDB, signal: lvds0_tx0_n, pin_signal: LVDS0_TX0_N}
  - {pin_num: U1, peripheral: LDB, signal: lvds0_tx0_p, pin_signal: LVDS0_TX0_P}
  - {pin_num: U4, peripheral: LDB, signal: lvds0_tx1_n, pin_signal: LVDS0_TX1_N}
  - {pin_num: U3, peripheral: LDB, signal: lvds0_tx1_p, pin_signal: LVDS0_TX1_P}
  - {pin_num: V2, peripheral: LDB, signal: lvds0_tx2_n, pin_signal: LVDS0_TX2_N}
  - {pin_num: V1, peripheral: LDB, signal: lvds0_tx2_p, pin_signal: LVDS0_TX2_P}
  - {pin_num: W2, peripheral: LDB, signal: lvds0_tx3_n, pin_signal: LVDS0_TX3_N}
  - {pin_num: W1, peripheral: LDB, signal: lvds0_tx3_p, pin_signal: LVDS0_TX3_P}
  - {pin_num: J5, peripheral: HDMI, signal: clkm, pin_signal: HDMI_CLKM}
  - {pin_num: J6, peripheral: HDMI, signal: clkp, pin_signal: HDMI_CLKP}
  - {pin_num: K5, peripheral: HDMI, signal: d0m, pin_signal: HDMI_D0M}
  - {pin_num: K6, peripheral: HDMI, signal: d0p, pin_signal: HDMI_D0P}
  - {pin_num: J3, peripheral: HDMI, signal: d1m, pin_signal: HDMI_D1M}
  - {pin_num: J4, peripheral: HDMI, signal: d1p, pin_signal: HDMI_D1P}
  - {pin_num: K3, peripheral: HDMI, signal: d2m, pin_signal: HDMI_D2M}
  - {pin_num: K4, peripheral: HDMI, signal: d2p, pin_signal: HDMI_D2P}
  - {pin_num: K2, peripheral: HDMI, signal: ddc_cec, pin_signal: HDMI_DDCCEC}
  - {pin_num: K1, peripheral: HDMI, signal: hpd, pin_signal: HDMI_HPD}
  - {pin_num: J1, peripheral: PMU, signal: hdmi_ref, pin_signal: HDMI_REF}
  - {pin_num: L7, peripheral: PMU, signal: hdmi_vp, pin_signal: HDMI_VP}
  - {pin_num: M7, peripheral: PMU, signal: hdmi_vph, pin_signal: HDMI_VPH}
  - {pin_num: M2, peripheral: IPU1, signal: 'csi0_d, 12', pin_signal: CSI0_DAT12}
  - {pin_num: L1, peripheral: IPU1, signal: 'csi0_d, 13', pin_signal: CSI0_DAT13}
  - {pin_num: M4, peripheral: IPU1, signal: 'csi0_d, 14', pin_signal: CSI0_DAT14}
  - {pin_num: M5, peripheral: IPU1, signal: 'csi0_d, 15', pin_signal: CSI0_DAT15}
  - {pin_num: L4, peripheral: IPU1, signal: 'csi0_d, 16', pin_signal: CSI0_DAT16}
  - {pin_num: L3, peripheral: IPU1, signal: 'csi0_d, 17', pin_signal: CSI0_DAT17}
  - {pin_num: M6, peripheral: IPU1, signal: 'csi0_d, 18', pin_signal: CSI0_DAT18}
  - {pin_num: L6, peripheral: IPU1, signal: 'csi0_d, 19', pin_signal: CSI0_DAT19}
  - {pin_num: P4, peripheral: IPU1, signal: csi0_hsync, pin_signal: CSI0_MCLK}
  - {pin_num: P1, peripheral: IPU1, signal: csi0_pixclk, pin_signal: CSI0_PIXCLK}
  - {pin_num: N2, peripheral: IPU1, signal: csi0_vsync, pin_signal: CSI0_VSYNC}
  - {pin_num: D4, peripheral: PMU, signal: mipi_csi_rext, pin_signal: CSI_REXT}
  - {pin_num: F3, peripheral: MIPI_CSI, signal: csi_clk0p, pin_signal: CSI_CLK0P}
  - {pin_num: F4, peripheral: MIPI_CSI, signal: csi_clk0m, pin_signal: CSI_CLK0M}
  - {pin_num: E3, peripheral: MIPI_CSI, signal: csi_d0p, pin_signal: CSI_D0P}
  - {pin_num: E4, peripheral: MIPI_CSI, signal: csi_d0m, pin_signal: CSI_D0M}
  - {pin_num: D1, peripheral: MIPI_CSI, signal: csi_d1m, pin_signal: CSI_D1M}
  - {pin_num: D2, peripheral: MIPI_CSI, signal: csi_d1p, pin_signal: CSI_D1P}
  - {pin_num: E1, peripheral: MIPI_CSI, signal: csi_d2m, pin_signal: CSI_D2M}
  - {pin_num: E2, peripheral: MIPI_CSI, signal: csi_d2p, pin_signal: CSI_D2P}
  - {pin_num: F1, peripheral: MIPI_CSI, signal: csi_d3p, pin_signal: CSI_D3P}
  - {pin_num: F2, peripheral: MIPI_CSI, signal: csi_d3m, pin_signal: CSI_D3M}
  - {pin_num: C23, peripheral: ENET, signal: anatop_ethernet_ref_out, pin_signal: RGMII_TX_CTL}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

