ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-A9 (Core #0)[ca9_0] */
  // HW_IOMUXC_ASRC_ASRCK_CLOCK_6_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_ASRC_ASRCK_CLOCK_6_SELECT_INPUT register modification value */
  // HW_IOMUXC_AUD4_INPUT_DA_AMX_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);    /* IOMUXC_AUD4_INPUT_DA_AMX_SELECT_INPUT register modification value */
  // HW_IOMUXC_AUD4_INPUT_DB_AMX_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);    /* IOMUXC_AUD4_INPUT_DB_AMX_SELECT_INPUT register modification value */
  // HW_IOMUXC_AUD4_INPUT_TXCLK_AMX_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u); /* IOMUXC_AUD4_INPUT_TXCLK_AMX_SELECT_INPUT register modification value */
  // HW_IOMUXC_AUD4_INPUT_TXFS_AMX_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);  /* IOMUXC_AUD4_INPUT_TXFS_AMX_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);       /* IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);      /* IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT register modification value */
  // HW_IOMUXC_ENET_REF_CLK_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);         /* IOMUXC_ENET_REF_CLK_SELECT_INPUT register modification value */
  // HW_IOMUXC_FLEXCAN1_RX_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_FLEXCAN1_RX_SELECT_INPUT register modification value */
  // HW_IOMUXC_HDMI_ICECIN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);          /* IOMUXC_HDMI_ICECIN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C1_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_I2C1_SCL_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C1_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_I2C1_SDA_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C2_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_I2C2_SCL_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C2_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_I2C2_SDA_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C3_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);          /* IOMUXC_I2C3_SCL_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_I2C3_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);          /* IOMUXC_I2C3_SDA_IN_SELECT_INPUT register modification value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA04_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA04 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA04_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA04 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA05_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA05 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA05_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA05 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA06_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA06 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA06_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA06 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA07_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA07 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA07_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA07 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_SET(IOMUXC_BASE, 0x00000004u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_CLR(IOMUXC_BASE, 0x00000003u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_SET(IOMUXC_BASE, 0x00000004u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_CLR(IOMUXC_BASE, 0x00000003u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_SET(IOMUXC_BASE, 0x00000003u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_CLR(IOMUXC_BASE, 0x00000004u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_SET(IOMUXC_BASE, 0x00000003u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_CLR(IOMUXC_BASE, 0x00000004u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA12_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA12 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA13_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA13 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA14_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA14 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA15_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA15 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA16_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA16 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA17_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA17 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA18_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA18 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA19_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA19 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA_EN_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA_EN register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA_EN_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA_EN register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_HSYNC_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_CSI0_HSYNC register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_PIXCLK_CLR(IOMUXC_BASE, 0x00000007u);       /* IOMUXC_SW_MUX_CTL_PAD_CSI0_PIXCLK register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_VSYNC_CLR(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_CSI0_VSYNC register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA00_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA00 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA00_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA00 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA01_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA01 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA01_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA01 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA02_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA02 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA02_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA02 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA03_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA03 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA03_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA03 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA04_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA04 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA04_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA04 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA08_SET(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA08 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA08_CLR(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA08 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA09_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA09 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA09_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA09 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA20_SET(IOMUXC_BASE, 0x00000003u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA20 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA20_CLR(IOMUXC_BASE, 0x00000004u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA20 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA21_SET(IOMUXC_BASE, 0x00000003u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA21 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA21_CLR(IOMUXC_BASE, 0x00000004u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA21 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA22_SET(IOMUXC_BASE, 0x00000003u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA22 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA22_CLR(IOMUXC_BASE, 0x00000004u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA22 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA23_SET(IOMUXC_BASE, 0x00000003u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA23 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA23_CLR(IOMUXC_BASE, 0x00000004u);      /* IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA23 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD00_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD00 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD01_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD01 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD02_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD02 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD03_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD03 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD04_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD04 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD05_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD05 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD06_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD06 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD07_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD07 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD08_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD08 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD09_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD09 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD10_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD10 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD11_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD11 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD12_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD12 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD13_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD13 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD14_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD14 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD15_SET(IOMUXC_BASE, 0x00000007u);          /* IOMUXC_SW_MUX_CTL_PAD_EIM_AD15 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR25_SET(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR25 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR25_CLR(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR25 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_SET(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_CLR(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_SET(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_CLR(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_SET(IOMUXC_BASE, 0x00000004u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_CLR(IOMUXC_BASE, 0x00000003u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_SET(IOMUXC_BASE, 0x00000004u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_CLR(IOMUXC_BASE, 0x00000003u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_SET(IOMUXC_BASE, 0x00000004u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_CLR(IOMUXC_BASE, 0x00000003u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_SET(IOMUXC_BASE, 0x00000004u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27 register set mask value */
