ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_CLR(IOMUXC_BASE, 0x00000003u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_SET(IOMUXC_BASE, 0x00000005u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_CLR(IOMUXC_BASE, 0x00000002u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B_SET(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B_SET(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B_SET(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B_SET(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B_SET(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_RW_SET(IOMUXC_BASE, 0x00000007u);            /* IOMUXC_SW_MUX_CTL_PAD_EIM_RW register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B_SET(IOMUXC_BASE, 0x00000007u);        /* IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_CRS_DV_SET(IOMUXC_BASE, 0x00000001u);       /* IOMUXC_SW_MUX_CTL_PAD_ENET_CRS_DV register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_CRS_DV_CLR(IOMUXC_BASE, 0x00000006u);       /* IOMUXC_SW_MUX_CTL_PAD_ENET_CRS_DV register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_SET(IOMUXC_BASE, 0x00000001u);          /* IOMUXC_SW_MUX_CTL_PAD_ENET_MDC register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_CLR(IOMUXC_BASE, 0x00000006u);          /* IOMUXC_SW_MUX_CTL_PAD_ENET_MDC register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_SET(IOMUXC_BASE, 0x00000001u);         /* IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_CLR(IOMUXC_BASE, 0x00000006u);         /* IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_REF_CLK_SET(IOMUXC_BASE, 0x00000005u);      /* IOMUXC_SW_MUX_CTL_PAD_ENET_REF_CLK register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_REF_CLK_CLR(IOMUXC_BASE, 0x00000002u);      /* IOMUXC_SW_MUX_CTL_PAD_ENET_REF_CLK register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA0_SET(IOMUXC_BASE, 0x00000001u);     /* IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA0 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA0_CLR(IOMUXC_BASE, 0x00000006u);     /* IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA1_SET(IOMUXC_BASE, 0x00000001u);     /* IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA1 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA1_CLR(IOMUXC_BASE, 0x00000006u);     /* IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_SET(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_CLR(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA0_SET(IOMUXC_BASE, 0x00000001u);     /* IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA0 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA0_CLR(IOMUXC_BASE, 0x00000006u);     /* IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA1_SET(IOMUXC_BASE, 0x00000001u);     /* IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA1 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA1_CLR(IOMUXC_BASE, 0x00000006u);     /* IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_SET(IOMUXC_BASE, 0x00000001u);        /* IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_CLR(IOMUXC_BASE, 0x00000006u);        /* IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO00_SET(IOMUXC_BASE, 0x00000003u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO00 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO00_CLR(IOMUXC_BASE, 0x00000004u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO00 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO01_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO01 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO01_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO01 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO02_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO02 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO02_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO02 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO03_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO03 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO03_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO03 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO04_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO04 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO04_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO04 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO05_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO05 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO05_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO05 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO06_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO06 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO06_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO06 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO07_SET(IOMUXC_BASE, 0x00000003u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO07 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO07_CLR(IOMUXC_BASE, 0x00000004u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO07 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO08_SET(IOMUXC_BASE, 0x00000003u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO08 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO08_CLR(IOMUXC_BASE, 0x00000004u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO08 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO09_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO09 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO09_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO09 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO16_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO16 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO16_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO16 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO17_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO17 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO17_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO17 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO18_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO18 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO18_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO18 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO19_SET(IOMUXC_BASE, 0x00000005u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO19 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_GPIO19_CLR(IOMUXC_BASE, 0x00000002u);            /* IOMUXC_SW_MUX_CTL_PAD_GPIO19 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_SET(IOMUXC_BASE, 0x00000004u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL0 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_CLR(IOMUXC_BASE, 0x00000003u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_SET(IOMUXC_BASE, 0x00000004u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL1 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_CLR(IOMUXC_BASE, 0x00000003u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL2_SET(IOMUXC_BASE, 0x00000005u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL2 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL2_CLR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_SET(IOMUXC_BASE, 0x00000004u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL3 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_CLR(IOMUXC_BASE, 0x00000003u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_SET(IOMUXC_BASE, 0x00000005u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL4 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_CLR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_COL4 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_SET(IOMUXC_BASE, 0x00000004u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_CLR(IOMUXC_BASE, 0x00000003u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_SET(IOMUXC_BASE, 0x00000004u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_CLR(IOMUXC_BASE, 0x00000003u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_SET(IOMUXC_BASE, 0x00000005u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_CLR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_SET(IOMUXC_BASE, 0x00000004u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_CLR(IOMUXC_BASE, 0x00000003u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_SET(IOMUXC_BASE, 0x00000005u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_CLR(IOMUXC_BASE, 0x00000002u);          /* IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_SET(IOMUXC_BASE, 0x00000005u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_CLR(IOMUXC_BASE, 0x00000002u);       /* IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_SET(IOMUXC_BASE, 0x00000007u);      /* IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_CLK_CLR(IOMUXC_BASE, 0x00000007u);           /* IOMUXC_SW_MUX_CTL_PAD_SD1_CLK register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_CMD_CLR(IOMUXC_BASE, 0x00000007u);           /* IOMUXC_SW_MUX_CTL_PAD_SD1_CMD register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA0_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD1_DATA0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA1_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD1_DATA1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA0_SET(IOMUXC_BASE, 0x00000005u);         /* IOMUXC_SW_MUX_CTL_PAD_SD2_DATA0 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA0_CLR(IOMUXC_BASE, 0x00000002u);         /* IOMUXC_SW_MUX_CTL_PAD_SD2_DATA0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA2_SET(IOMUXC_BASE, 0x00000005u);         /* IOMUXC_SW_MUX_CTL_PAD_SD2_DATA2 register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA2_CLR(IOMUXC_BASE, 0x00000002u);         /* IOMUXC_SW_MUX_CTL_PAD_SD2_DATA2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_CLK_CLR(IOMUXC_BASE, 0x00000007u);           /* IOMUXC_SW_MUX_CTL_PAD_SD3_CLK register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_CMD_CLR(IOMUXC_BASE, 0x00000007u);           /* IOMUXC_SW_MUX_CTL_PAD_SD3_CMD register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7 register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD3_RESET_CLR(IOMUXC_BASE, 0x00000007u);         /* IOMUXC_SW_MUX_CTL_PAD_SD3_RESET register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_CLK_SET(IOMUXC_BASE, 0x00000002u);           /* IOMUXC_SW_MUX_CTL_PAD_SD4_CLK register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_CLK_CLR(IOMUXC_BASE, 0x00000005u);           /* IOMUXC_SW_MUX_CTL_PAD_SD4_CLK register clear mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_CMD_SET(IOMUXC_BASE, 0x00000002u);           /* IOMUXC_SW_MUX_CTL_PAD_SD4_CMD register set mask value */
  // HW_IOMUXC_SW_MUX_CTL_PAD_SD4_CMD_CLR(IOMUXC_BASE, 0x00000005u);           /* IOMUXC_SW_MUX_CTL_PAD_SD4_CMD register clear mask value */
  // HW_IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT register modification value */
  // HW_IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT register modification value */
  // HW_IOMUXC_UART3_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000003u);   /* IOMUXC_UART3_UART_RX_DATA_SELECT_INPUT register modification value */
  // HW_IOMUXC_UART4_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_UART4_UART_RX_DATA_SELECT_INPUT register modification value */
  // HW_IOMUXC_UART5_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000001u);   /* IOMUXC_UART5_UART_RX_DATA_SELECT_INPUT register modification value */
  // HW_IOMUXC_USB_OTG_OC_SELECT_INPUT_WR(IOMUXC_BASE, 0x00000000u);           /* IOMUXC_USB_OTG_OC_SELECT_INPUT register modification value */
  // Note: The commented code above is generated by the tool in case of simplified register modification using direct values only are needed.
  HW_IOMUXC_ASRC_ASRCK_CLOCK_6_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ASRC_ASRCK_CLOCK_6_SELECT_INPUT_DAISY(BV_IOMUXC_ASRC_ASRCK_CLOCK_6_SELECT_INPUT_DAISY_GPIO00_ALT3)); /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad GPIO_0 for ASRC_EXT_CLK. */
  HW_IOMUXC_AUD4_INPUT_DA_AMX_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_AUD4_INPUT_DA_AMX_SELECT_INPUT_DAISY(BV_IOMUXC_AUD4_INPUT_DA_AMX_SELECT_INPUT_DAISY_DISP0_DATA23_ALT3)); /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad DISP0_DAT23 for AUD4_RXD. */
  HW_IOMUXC_AUD4_INPUT_DB_AMX_SELECT_INPUT_WR(IOMUXC_BASE,
