ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
      BF_IOMUXC_AUD4_INPUT_DB_AMX_SELECT_INPUT_DAISY(BV_IOMUXC_AUD4_INPUT_DB_AMX_SELECT_INPUT_DAISY_DISP0_DATA21_ALT3)); /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad DISP0_DAT21 for AUD4_TXD. */
  HW_IOMUXC_AUD4_INPUT_TXCLK_AMX_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_AUD4_INPUT_TXCLK_AMX_SELECT_INPUT_DAISY(BV_IOMUXC_AUD4_INPUT_TXCLK_AMX_SELECT_INPUT_DAISY_DISP0_DATA20_ALT3)); /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad DISP0_DAT20 for AUD4_TXC. */
  HW_IOMUXC_AUD4_INPUT_TXFS_AMX_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_AUD4_INPUT_TXFS_AMX_SELECT_INPUT_DAISY(BV_IOMUXC_AUD4_INPUT_TXFS_AMX_SELECT_INPUT_DAISY_DISP0_DATA22_ALT3)); /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad DISP0_DAT22 for AUD4_TXFS. */
  HW_IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_MDIO_SELECT_INPUT_DAISY_ENET_MDIO_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad ENET_MDIO for ENET_MDIO. */
  HW_IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUT_DAISY_ENET_RX_DATA0_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad ENET_RXD0 for ENET_RX_DATA0. */
  HW_IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUT_DAISY_ENET_RX_DATA1_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad ENET_RXD1 for ENET_RX_DATA1. */
  HW_IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUT_DAISY_ENET_CRS_DV_ALT1)); /* Input Select (DAISY) Field: Selecting ALT1MUX Mode Select Field. mode of pad ENET_CRS_DV for ENET_RX_EN. */
  HW_IOMUXC_ENET_REF_CLK_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_ENET_REF_CLK_SELECT_INPUT_DAISY(BV_IOMUXC_ENET_REF_CLK_SELECT_INPUT_DAISY_RGMII_TX_CTL_ALT7)); /* Input Select (DAISY) Field: Selecting ALT7MUX Mode Select Field. mode of pad RGMII_TX_CTL for ENET_REF_CLK. */
  HW_IOMUXC_FLEXCAN1_RX_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY(BV_IOMUXC_FLEXCAN1_RX_SELECT_INPUT_DAISY_GPIO08_ALT3));       /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad GPIO_8 for FLEXCAN1_RX. */
  HW_IOMUXC_HDMI_ICECIN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_HDMI_ICECIN_SELECT_INPUT_DAISY(BV_IOMUXC_HDMI_ICECIN_SELECT_INPUT_DAISY_EIM_ADDR25_ALT6));   /* Input Select (DAISY) Field: Selecting ALT6MUX Mode Select Field. mode of pad EIM_A25 for HDMI_TX_CEC_LINE. */
  HW_IOMUXC_I2C1_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C1_SCL_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C1_SCL_IN_SELECT_INPUT_DAISY_CSI0_DATA09_ALT4));  /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad CSI0_DAT9 for I2C1_SCL. */
  HW_IOMUXC_I2C1_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C1_SDA_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C1_SDA_IN_SELECT_INPUT_DAISY_CSI0_DATA08_ALT4));  /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad CSI0_DAT8 for I2C1_SDA. */
  HW_IOMUXC_I2C2_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C2_SCL_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C2_SCL_IN_SELECT_INPUT_DAISY_KEY_COL3_ALT4));     /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad KEY_COL3 for I2C2_SCL. */
  HW_IOMUXC_I2C2_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C2_SDA_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C2_SDA_IN_SELECT_INPUT_DAISY_KEY_ROW3_ALT4));     /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad KEY_ROW3 for I2C2_SDA. */
  HW_IOMUXC_I2C3_SCL_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C3_SCL_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C3_SCL_IN_SELECT_INPUT_DAISY_EIM_DATA17_ALT6));   /* Input Select (DAISY) Field: Selecting ALT6MUX Mode Select Field. mode of pad EIM_D17 for I2C3_SCL. */
  HW_IOMUXC_I2C3_SDA_IN_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_I2C3_SDA_IN_SELECT_INPUT_DAISY(BV_IOMUXC_I2C3_SDA_IN_SELECT_INPUT_DAISY_EIM_DATA18_ALT6));   /* Input Select (DAISY) Field: Selecting ALT6MUX Mode Select Field. mode of pad EIM_D18 for I2C3_SDA. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA04_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA04_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA04_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO5_IO22. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA05_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA05_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA05_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO5_IO23. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA06_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA06_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA06_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO5_IO24. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA07_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA07_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA07_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO5_IO25. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA08_MUX_MODE_ALT4));    /* MUX Mode Select Field: Select signal I2C1_SDA.- Configure register IOMUXC_I2C1_SDA_IN_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA09_MUX_MODE_ALT4));    /* MUX Mode Select Field: Select signal I2C1_SCL.- Configure register IOMUXC_I2C1_SCL_IN_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA10_MUX_MODE_ALT3));    /* MUX Mode Select Field: Select signal UART1_TX_DATA.- Configure register IOMUXC_UART1_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA11_MUX_MODE_ALT3));    /* MUX Mode Select Field: Select signal UART1_RX_DATA.- Configure register IOMUXC_UART1_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA12_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA12_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA12_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_DATA12. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA13_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA13_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA13_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_DATA13. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA14_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA14_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA14_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_DATA14. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA15_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA15_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA15_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_DATA15. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA16_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA16_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA16_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_DATA16. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA17_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA17_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA17_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_DATA17. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA18_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_DATA18. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA19_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA19_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA19_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_DATA19. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA_EN_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA_EN_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_DATA_EN_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO5_IO20. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_HSYNC_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_HSYNC_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_HSYNC_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal IPU1_CSI0_HSYNC. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_PIXCLK_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_PIXCLK_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_PIXCLK_MUX_MODE_ALT0));    /* MUX Mode Select Field: Select signal IPU1_CSI0_PIXCLK. */
  HW_IOMUXC_SW_MUX_CTL_PAD_CSI0_VSYNC_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_CSI0_VSYNC_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_CSI0_VSYNC_MUX_MODE_ALT0));      /* MUX Mode Select Field: Select signal IPU1_CSI0_VSYNC. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA00_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA00_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA00_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO4_IO21. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA01_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA01_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA01_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO4_IO22. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA02_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA02_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA02_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO4_IO23. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA03_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA03_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA03_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO4_IO24. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA04_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA04_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA04_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO4_IO25. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA08_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA08_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA08_MUX_MODE_ALT2));  /* MUX Mode Select Field: Select signal PWM1_OUT. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA09_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA09_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA09_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO4_IO30. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA18_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO5_IO12. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA20_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA20_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA20_MUX_MODE_ALT3));  /* MUX Mode Select Field: Select signal AUD4_TXC.- Configure register IOMUXC_AUD4_INPUT_TXCLK_AMX_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA21_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA21_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA21_MUX_MODE_ALT3));  /* MUX Mode Select Field: Select signal AUD4_TXD.- Configure register IOMUXC_AUD4_INPUT_DB_AMX_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA22_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA22_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA22_MUX_MODE_ALT3));  /* MUX Mode Select Field: Select signal AUD4_TXFS.- Configure register IOMUXC_AUD4_INPUT_TXFS_AMX_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA23_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA23_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_DISP0_DATA23_MUX_MODE_ALT3));  /* MUX Mode Select Field: Select signal AUD4_RXD.- Configure register IOMUXC_AUD4_INPUT_DA_AMX_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD00_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD00_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD00_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG00. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD01_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD01_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD01_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG01. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD02_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD02_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD02_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG02. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD03_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD03_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD03_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG03. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD04_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD04_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD04_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG04. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD05_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD05_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD05_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG05. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD06_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD06_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD06_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG06. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD07_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD07_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD07_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG07. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD08_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD08_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD08_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG08. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD09_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD09_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD09_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG09. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD10_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD10_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD10_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG10. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD11_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD11_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD11_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG11. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD12_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD12_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD12_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG12. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD13_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD13_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD13_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG13. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD14_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD14_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD14_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG14. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_AD15_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_AD15_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_AD15_MUX_MODE_ALT7));          /* MUX Mode Select Field: Select signal SRC_BOOT_CFG15. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR16_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG16. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR17_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG17. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR18_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG18. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR19_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG19. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR20_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG20. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR21_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG21. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR22_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG22. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR23_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG23. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR24_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG24. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR25_WR(IOMUXC_BASE,
