ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR25_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_ADDR25_MUX_MODE_ALT6));      /* MUX Mode Select Field: Select signal HDMI_TX_CEC_LINE.- Configure register IOMUXC_HDMI_ICECIN_SELECT_INPUTSelect Input Register for mode ALT6. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA16_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO16. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA17_MUX_MODE_ALT6));      /* MUX Mode Select Field: Select signal I2C3_SCL.- Configure register IOMUXC_I2C3_SCL_IN_SELECT_INPUTSelect Input Register for mode ALT6. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA18_MUX_MODE_ALT6));      /* MUX Mode Select Field: Select signal I2C3_SDA.- Configure register IOMUXC_I2C3_SDA_IN_SELECT_INPUTSelect Input Register for mode ALT6. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA19_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO19. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA20_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO20. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA21_MUX_MODE_ALT4));      /* MUX Mode Select Field: Select signal USB_OTG_OC.- Configure register IOMUXC_USB_OTG_OC_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA22_MUX_MODE_ALT4));      /* MUX Mode Select Field: Select signal USB_OTG_PWR. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA23_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO23. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA24_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO24. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA25_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO25. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA26_MUX_MODE_ALT4));      /* MUX Mode Select Field: Select signal UART2_TX_DATA.- Configure register IOMUXC_UART2_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA27_MUX_MODE_ALT4));      /* MUX Mode Select Field: Select signal UART2_RX_DATA.- Configure register IOMUXC_UART2_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA28_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO28. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_DATA29_MUX_MODE_ALT5));      /* MUX Mode Select Field: Select signal GPIO3_IO29. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_EB0_B_MUX_MODE_ALT7));        /* MUX Mode Select Field: Select signal SRC_BOOT_CFG27. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_EB1_B_MUX_MODE_ALT7));        /* MUX Mode Select Field: Select signal SRC_BOOT_CFG28. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_EB2_B_MUX_MODE_ALT7));        /* MUX Mode Select Field: Select signal SRC_BOOT_CFG30. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_EB3_B_MUX_MODE_ALT7));        /* MUX Mode Select Field: Select signal SRC_BOOT_CFG31. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_LBA_B_MUX_MODE_ALT7));        /* MUX Mode Select Field: Select signal SRC_BOOT_CFG26. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_RW_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_RW_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_RW_MUX_MODE_ALT7));              /* MUX Mode Select Field: Select signal SRC_BOOT_CFG29. */
  HW_IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_EIM_WAIT_B_MUX_MODE_ALT7));      /* MUX Mode Select Field: Select signal SRC_BOOT_CFG25. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_CRS_DV_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_CRS_DV_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_CRS_DV_MUX_MODE_ALT1));    /* MUX Mode Select Field: Select signal ENET_RX_EN.- Configure register IOMUXC_ENET_MAC0_RX_EN_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_MDC_MUX_MODE_ALT1));          /* MUX Mode Select Field: Select signal ENET_MDC. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_MDIO_MUX_MODE_ALT1));        /* MUX Mode Select Field: Select signal ENET_MDIO.- Configure register IOMUXC_ENET_MAC0_MDIO_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_REF_CLK_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_REF_CLK_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_REF_CLK_MUX_MODE_ALT5));  /* MUX Mode Select Field: Select signal GPIO1_IO23. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA0_MUX_MODE_ALT1)); /* MUX Mode Select Field: Select signal ENET_RX_DATA0.- Configure register IOMUXC_ENET_MAC0_RX_DATA0_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_DATA1_MUX_MODE_ALT1)); /* MUX Mode Select Field: Select signal ENET_RX_DATA1.- Configure register IOMUXC_ENET_MAC0_RX_DATA1_SELECT_INPUTSelect Input Register for mode ALT1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_RX_ER_MUX_MODE_ALT1));      /* MUX Mode Select Field: Select signal ENET_RX_ER. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA0_MUX_MODE_ALT1)); /* MUX Mode Select Field: Select signal ENET_TX_DATA0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_DATA1_MUX_MODE_ALT1)); /* MUX Mode Select Field: Select signal ENET_TX_DATA1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_ENET_TX_EN_MUX_MODE_ALT1));      /* MUX Mode Select Field: Select signal ENET_TX_EN. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO00_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO00_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO00_MUX_MODE_ALT3));              /* MUX Mode Select Field: Select signal ASRC_EXT_CLK.- Configure register IOMUXC_ASRC_ASRCK_CLOCK_6_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO01_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO01_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO01_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO01. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO02_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO02_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO02_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO02. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO03_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO03_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO03_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO03. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO04_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO04_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO04_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO04. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO05_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO05_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO05_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO05. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO06_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO06_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO06_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO06. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO07_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO07_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO07_MUX_MODE_ALT3));              /* MUX Mode Select Field: Select signal FLEXCAN1_TX. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO08_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO08_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO08_MUX_MODE_ALT3));              /* MUX Mode Select Field: Select signal FLEXCAN1_RX.- Configure register IOMUXC_FLEXCAN1_RX_SELECT_INPUTSelect Input Register for mode ALT3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO09_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO09_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO09_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO1_IO09. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO16_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO16_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO16_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO7_IO11. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO17_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO17_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO17_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO7_IO12. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO18_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO18_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO18_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO7_IO13. */
  HW_IOMUXC_SW_MUX_CTL_PAD_GPIO19_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_GPIO19_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_GPIO19_MUX_MODE_ALT5));              /* MUX Mode Select Field: Select signal GPIO4_IO05. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL0_MUX_MODE_ALT4));          /* MUX Mode Select Field: Select signal UART4_TX_DATA.- Configure register IOMUXC_UART4_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL1_MUX_MODE_ALT4));          /* MUX Mode Select Field: Select signal UART5_TX_DATA.- Configure register IOMUXC_UART5_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL2_MUX_MODE_ALT5));          /* MUX Mode Select Field: Select signal GPIO4_IO10. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL3_MUX_MODE_ALT4));          /* MUX Mode Select Field: Select signal I2C2_SCL.- Configure register IOMUXC_I2C2_SCL_IN_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_COL4_MUX_MODE_ALT5));          /* MUX Mode Select Field: Select signal GPIO4_IO14. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW0_MUX_MODE_ALT4));          /* MUX Mode Select Field: Select signal UART4_RX_DATA.- Configure register IOMUXC_UART4_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW1_MUX_MODE_ALT4));          /* MUX Mode Select Field: Select signal UART5_RX_DATA.- Configure register IOMUXC_UART5_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW2_MUX_MODE_ALT5));          /* MUX Mode Select Field: Select signal GPIO4_IO11. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW3_MUX_MODE_ALT4));          /* MUX Mode Select Field: Select signal I2C2_SDA.- Configure register IOMUXC_I2C2_SDA_IN_SELECT_INPUTSelect Input Register for mode ALT4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_KEY_ROW4_MUX_MODE_ALT5));          /* MUX Mode Select Field: Select signal GPIO4_IO15. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA00_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO00. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA01_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO01. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA02_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO02. */
  HW_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_NAND_DATA03_MUX_MODE_ALT5));    /* MUX Mode Select Field: Select signal GPIO2_IO03. */
  HW_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_RGMII_TX_CTL_MUX_MODE_ALT7));  /* MUX Mode Select Field: Select signal ENET_REF_CLK.- Configure register IOMUXC_ENET_REF_CLK_SELECT_INPUTSelect Input Register for mode ALT7. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD1_CLK_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD1_CLK_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD1_CLK_MUX_MODE_ALT0));            /* MUX Mode Select Field: Select signal SD1_CLK. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD1_CMD_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD1_CMD_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD1_CMD_MUX_MODE_ALT0));            /* MUX Mode Select Field: Select signal SD1_CMD. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA0_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD1_DATA0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA1_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD1_DATA1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA2_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD1_DATA2. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD1_DATA3_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD1_DATA3. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA0_MUX_MODE_ALT5));        /* MUX Mode Select Field: Select signal GPIO1_IO15. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD2_DATA2_MUX_MODE_ALT5));        /* MUX Mode Select Field: Select signal GPIO1_IO13. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_CLK_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_CLK_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_CLK_MUX_MODE_ALT0));            /* MUX Mode Select Field: Select signal SD3_CLK. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_CMD_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_CMD_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_CMD_MUX_MODE_ALT0));            /* MUX Mode Select Field: Select signal SD3_CMD. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA0_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA0. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA1_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA1. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA2_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA2. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA3_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA3. */
