ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.c
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA4_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA4. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA5_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA5. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA6_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA6. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_DATA7_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_DATA7. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD3_RESET_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD3_RESET_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD3_RESET_MUX_MODE_ALT0));        /* MUX Mode Select Field: Select signal SD3_RESET. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD4_CLK_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD4_CLK_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD4_CLK_MUX_MODE_ALT2));            /* MUX Mode Select Field: Select signal UART3_RX_DATA.- Configure register IOMUXC_UART3_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT2. */
  HW_IOMUXC_SW_MUX_CTL_PAD_SD4_CMD_WR(IOMUXC_BASE,
      BF_IOMUXC_SW_MUX_CTL_PAD_SD4_CMD_MUX_MODE(BV_IOMUXC_SW_MUX_CTL_PAD_SD4_CMD_MUX_MODE_ALT2));            /* MUX Mode Select Field: Select signal UART3_TX_DATA.- Configure register IOMUXC_UART3_UART_RX_DATA_SELECT_INPUTSelect Input Register for mode ALT2. */
  HW_IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT_DAISY(BV_IOMUXC_UART1_UART_RX_DATA_SELECT_INPUT_DAISY_CSI0_DATA11_ALT3)); /* Input Select (DAISY) Field: Selecting ALT3MUX Mode Select Field. mode of pad CSI0_DAT11 for UART1_RX_DATA. */
  HW_IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT_DAISY(BV_IOMUXC_UART2_UART_RX_DATA_SELECT_INPUT_DAISY_EIM_DATA27_ALT4)); /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad EIM_D27 for UART2_RX_DATA. */
  HW_IOMUXC_UART3_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_UART3_UART_RX_DATA_SELECT_INPUT_DAISY(BV_IOMUXC_UART3_UART_RX_DATA_SELECT_INPUT_DAISY_SD4_CLK_ALT2)); /* Input Select (DAISY) Field: Selecting ALT2MUX Mode Select Field. mode of pad SD4_CLK for UART3_RX_DATA. */
  HW_IOMUXC_UART4_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_UART4_UART_RX_DATA_SELECT_INPUT_DAISY(BV_IOMUXC_UART4_UART_RX_DATA_SELECT_INPUT_DAISY_KEY_ROW0_ALT4)); /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad KEY_ROW0 for UART4_RX_DATA. */
  HW_IOMUXC_UART5_UART_RX_DATA_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_UART5_UART_RX_DATA_SELECT_INPUT_DAISY(BV_IOMUXC_UART5_UART_RX_DATA_SELECT_INPUT_DAISY_KEY_ROW1_ALT4)); /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad KEY_ROW1 for UART5_RX_DATA. */
  HW_IOMUXC_USB_OTG_OC_SELECT_INPUT_WR(IOMUXC_BASE,
      BF_IOMUXC_USB_OTG_OC_SELECT_INPUT_DAISY(BV_IOMUXC_USB_OTG_OC_SELECT_INPUT_DAISY_EIM_DATA21_ALT4));     /* Input Select (DAISY) Field: Selecting ALT4MUX Mode Select Field. mode of pad EIM_D21 for USB_OTG_OC. */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
